users/aziz/.config/emacs/az-emacs.org
#+title: GNU emacs literate configuration
#+email: abdalaziz.rashid@outlook.com
#+author: Abdalaziz (Aziz) R. A.M.
#+language: en
#+options: ':t toc:nil author:t email:t num:t
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last revised and exported on {{{latest-export-date}}} with a word
count of {{{word-count}}}.*

* Early init configurations
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Set it to big number(100mb) like most of the popular starter kits
  ;; like Spacemacs/Doom/Prelude, etc do: Follow the method recommended
  ;; by Gnu Emacs Maintainer Eli Zaretskii: "My suggestion is to
  ;; repeatedly multiply gc-cons-threshold by 2 until you stop seeing
  ;; significant improvements in responsiveness, and in any case not to
  ;; increase by a factor larger than 100 or somesuch. If even a
  ;; 100-fold increase doesn't help, there's some deeper problem with
  ;; the Lisp code which produces so much garbage, or maybe GC is not
  ;; the reason for slowdown." Source:
  ;; <https://www.reddit.com/r/emacs/comments/brc05y/is_lspmode_too_slow_to_use_for_anyone_else/eofulix/>

  (setq gc-cons-threshold 100000000)

  ;; Increase the amount of data which Emacs reads from the process#
  ;; Again the emacs default is too low 4k considering that the some of
  ;; the language server responses are in 800k - 3M range.
  (setq read-process-output-max (* 1024 1024)) ;; 1mb

  ;; plists provide better performance in deserialization and also put
  ;; less presure than hash-tables
  (setenv "LSP_USE_PLISTS" "true")

  ;; Disable the tool bar
  (tool-bar-mode -1)
  (menu-bar-mode 1)
  (toggle-scroll-bar -1) 
  (scroll-bar-mode -1)
#+end_src

#+begin_src emacs-lisp :tangle "early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)
#+end_src

