users/aziz/blog/az-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-17 Wed 03:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU emacs literate configuration</title>
<meta name="author" content="Abdalaziz (Aziz) R. A.M." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">GNU emacs literate configuration</h1>
<p>
<b>Last revised and exported on 2024-07-17 03:58:09 +0300 with a word
count of 7390.</b>
</p>
<div id="outline-container-orgae8ad8d" class="outline-2">
<h2 id="orgae8ad8d"><span class="section-number-2">1.</span> Early init configurations</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Set it to big number(100mb) like most of the popular starter kits</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">like Spacemacs/Doom/Prelude, etc do: Follow the method recommended</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">by Gnu Emacs Maintainer Eli Zaretskii: "My suggestion is to</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">repeatedly multiply gc-cons-threshold by 2 until you stop seeing</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">significant improvements in responsiveness, and in any case not to</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">increase by a factor larger than 100 or somesuch. If even a</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">100-fold increase doesn't help, there's some deeper problem with</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">the Lisp code which produces so much garbage, or maybe GC is not</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">the reason for slowdown." Source:</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;"><a href="https://www.reddit.com/r/emacs/comments/brc05y/is_lspmode_too_slow_to_use_for_anyone_else/eofulix/">&lt;https://www.reddit.com/r/emacs/comments/brc05y/is_lspmode_too_slow_to_use_for_anyone_else/eofulix/&gt;</a></span>

(<span style="color: #531ab6;">setq</span> gc-cons-threshold 100000000)

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Increase the amount of data which Emacs reads from the process#</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Again the emacs default is too low 4k considering that the some of</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">the language server responses are in 800k - 3M range.</span>
(<span style="color: #531ab6;">setq</span> read-process-output-max (* 1024 1024)) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">1mb</span>

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">plists provide better performance in deserialization and also put</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">less presure than hash-tables</span>
(setenv <span style="color: #3548cf;">"LSP_USE_PLISTS"</span> <span style="color: #3548cf;">"true"</span>)

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Disable the tool bar</span>
(tool-bar-mode -1)
(menu-bar-mode 1)
(toggle-scroll-bar -1) 
(scroll-bar-mode -1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setq</span> frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      frame-title-format '(<span style="color: #3548cf;">"%b"</span>)
      ring-bell-function 'ignore
      use-dialog-box t <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">only for mouse events, which I seldom use</span>
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">read the docstring</span>
      inhibit-startup-buffer-menu t)
</pre>
</div>
</div>
</div>
