users/aziz/.config/emacs/az-emacs.org
* Main emacs configs
Packages customizations are defined here
#+begin_src emacs-lisp :tangle "init.el"
  ;; Garbage collect after startup
  (add-hook 'after-init-hook #'garbage-collect t)
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name
	  "straight/repos/straight.el/bootstrap.el"
	  (or (bound-and-true-p straight-base-dir)
	      user-emacs-directory)))
	(bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))


  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
  ;; :config
  ;; ;; Setup a personal keymap. I'll bind various things to this later on:
  (bind-keys :prefix "<f1>"
	     :prefix-map my/map)
  (setq use-package-enable-imenu-support t
	use-package-compute-statistics t)
  (straight-use-package 'org)
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle "init.el"
  (use-package modus-themes
    :init
    ;; Add all your customizations prior to loading the themes
    (setq modus-themes-italic-constructs t
  	modus-themes-bold-constructs t
  	modus-themes-region '(bg-only)
  	modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi))
    (setq modus-themes-custom-auto-reload nil
  	modus-themes-to-toggle '(modus-operandi modus-vivendi)
  	;; modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted)
  	;; modus-themes-to-toggle '(modus-operandi-deuteranopia modus-vivendi-deuteranopia)
  	;; modus-themes-to-toggle '(modus-operandi-tritanopia modus-vivendi-tritanopia)
  	modus-themes-mixed-fonts t
  	modus-themes-variable-pitch-ui t
  	modus-themes-italic-constructs t
  	modus-themes-bold-constructs nil
  	modus-themes-org-blocks nil
  	modus-themes-completions '((t . (extrabold)))
  	modus-themes-prompts '(extrabold)
    ;; 	modus-themes-headings
    ;; 	'((agenda-structure . (variable-pitch light 2.2))
    ;;         (agenda-date . (variable-pitch regular 1.3))
    ;;         (t . (regular 1.15))))

    ;; (setq 
     modus-themes-common-palette-overrides nil
    ;; '((bg-mode-line-active bg-cyan-subtle)
    ;;   (keybind yellow-warmer))
  	 )


    :bind ("<f5>" . modus-themes-toggle)

    :config
    ;; Load the theme of your choice:
    (load-theme 'modus-operandi-tinted :no-confirm)
    (modus-themes-select 'modus-operandi-tinted)
    )
#+end_src

Emacs configurations
#+begin_src emacs-lisp

  ;; Using `use-package` to configure emacs, here emacs is a pseudo
  ;; package
  (use-package emacs
    :bind* (
            ("M-o" . ace-window)
            ("C-x <C-m>" . execute-extended-command)
            ("C-c <C-m>" . execute-extended-command) ;; Sloppy version
            ("C-h h" . nil) ;; Disable the hello page
            )
    
    :custom
    (user-full-name "A.R.M")


    ;; Settings for the Cocoa port
    (ns-alternate-modifier 'super)
    (ns-command-modifier 'meta)
    (ns-function-modifier 'hyper)
    (ns-right-alternate-modifier 'super)

    ;; Settings for the Emacs Mac-port
    (mac-command-modifier 'meta)
    (mac-option-modifier 'super)
    (mac-pass-command-to-system nil)

    (frame-title-format
     '(:eval
       (concat
        (if buffer-file-name default-directory "%b")
        "    "
        (number-to-string
         (cdr
          (assq 'width
                (frame-parameters))))
        "x"
        (number-to-string
         (cdr
          (assq 'height
                (frame-parameters)))))))

    (completion-cycle-threshold 7)
    (completion-ignored-extensions
     '(".a"
       ".aux"
       ".bbl"
       ".bin"
       ".elc"
       ".git/"
       ".o"
       ".pyc"
       ".pyo"
       ".so"
       ".toc"
       "~"))

    ;; startup.el
    (auto-save-list-file-prefix (user-data "auto-save-list/.saves-"))
    (inhibit-startup-echo-area-message "aziz")
    (inhibit-startup-screen t)
    (initial-buffer-choice t)
    (initial-major-mode 'fundamental-mode)
    (initial-scratch-message "")
    (user-mail-address "abdalaziz.rashid@outlook.com")

    ;; files.el
    (auto-save-file-name-transforms '(("\\`/[^/]*:.*" "~/.emacs.d/auto-saves/" t)))
    (backup-directory-alist '(("." . "~/.local/share/emacs/backups")))
    (delete-old-versions t)
    (directory-abbrev-alist
     '(("\\`/org" . "~/org")
       ("\\`/home-manager" . "~/.config/home-manager")))
    (directory-free-space-args "-kh")
    (large-file-warning-threshold nil)
    (save-abbrevs 'silently)
    (trash-directory "~/.Trash")
    (version-control t)

    ;; bytecomp.el
    (byte-compile-verbose nil)

    ;; scroll-bar.el
    (scroll-bar-mode nil)

    ;; paren.el
    (show-paren-delay 0)

    ;; window.el
    (same-window-buffer-names
     '("*eshell*"
       "*shell*"
       "*mail*"
       "*inferior-lisp*"
       "*ielm*"
       "*scheme*"))
    (switch-to-buffer-preserve-window-point t)

    ;; warnings.el
    (warning-minimum-log-level :error)

    ;; frame.el
    (window-divider-default-bottom-width 1)
    (window-divider-default-places 'bottom-only)
    (add-to-list 'default-frame-alist '(fullscreen . maximized))


    ;; mwheel.el
    ;; TODO: disable keybindings to  mouse-wheel-global-text-scale
    ;; and mouse-wheel-text-scale
    (global-set-key (kbd "<C-wheel-up>") nil)
    (global-set-key (kbd "<C-wheel-down>") nil)

    (vc-follow-symlinks nil)
    :init
    (setq disabled-command-function nil) ;; enable all commands


    :config  
    ;; Setup font
    ;; (advice-add 'server-create-window-system-frame
    ;;              :after 'my/setup-fonts)
    ;; (advice-add 'server-create-tty-frame
    ;;              :after 'my/setup-fonts)
    ;; (unless (daemonp) (my/setup-fonts))

    ;; ;; En
    able line numbers only with programing modes
    ;; (add-hook 'prog-mode-hook (lambda () (
    ;;           display-line-numbers-mode
    ;;           (setq-default display-line-numbers-type 'relative))))

    ;; This is an ugly hack the fix is upstream but hasn't been merge yet
    ;; https://github.com/doomemacs/doomemacs/issues/7532
    (add-hook 'after-init-hook (lambda () 
                               (tool-bar-mode 1) 
                               (tool-bar-mode 0)))
    (defun my-toggle-toolbar (frame)
      "Toggle tool-bar-mode on then off when a new frame is created."
      (with-selected-frame frame
        (tool-bar-mode 1)
        (tool-bar-mode 0)))

    (add-hook 'after-make-frame-functions 'my-toggle-toolbar)
    )
#+end_src
