users/aziz/blog/az-emacs.html
<div id="outline-container-org51c6747" class="outline-2">
<h2 id="org51c6747"><span class="section-number-2">2.</span> Main emacs configs</h2>
<div class="outline-text-2" id="text-2">
<p>
Packages customizations are defined here
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Garbage collect after startup</span>
(add-hook 'after-init-hook #'garbage-collect t)
(<span style="color: #531ab6;">defvar</span> <span style="color: #005e8b;">bootstrap-version</span>)
(<span style="color: #531ab6;">let</span> ((bootstrap-file
         (expand-file-name
          <span style="color: #3548cf;">"straight/repos/straight.el/bootstrap.el"</span>
          (<span style="color: #531ab6;">or</span> (<span style="color: #531ab6;">bound-and-true-p</span> straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
  (<span style="color: #531ab6;">unless</span> (file-exists-p bootstrap-file)
    (<span style="color: #531ab6;">with-current-buffer</span>
          (url-retrieve-synchronously
           <span style="color: #3548cf;">"https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"</span>
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))


(straight-use-package 'use-package)
(<span style="color: #531ab6;">setq</span> straight-use-package-by-default t)
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">:config</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">;; Setup a personal keymap. I'll bind various things to this later on:</span>
(<span style="color: #531ab6;">bind-keys</span> <span style="color: #8f0075;">:prefix</span> <span style="color: #3548cf;">"&lt;f1&gt;"</span>
             <span style="color: #8f0075;">:prefix-map</span> my/map)
(<span style="color: #531ab6;">setq</span> use-package-enable-imenu-support t
        use-package-compute-statistics t)
(straight-use-package 'org)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">modus-themes</span>
  <span style="color: #8f0075;">:init</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Add all your customizations prior to loading the themes</span>
  (<span style="color: #531ab6;">setq</span> modus-themes-italic-constructs t
        modus-themes-bold-constructs t
        modus-themes-region '(bg-only)
        modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi))
  (<span style="color: #531ab6;">setq</span> modus-themes-custom-auto-reload nil
        modus-themes-to-toggle '(modus-operandi modus-vivendi)
        <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted)</span>
        <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">modus-themes-to-toggle '(modus-operandi-deuteranopia modus-vivendi-deuteranopia)</span>
        <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">modus-themes-to-toggle '(modus-operandi-tritanopia modus-vivendi-tritanopia)</span>
        modus-themes-mixed-fonts t
        modus-themes-variable-pitch-ui t
        modus-themes-italic-constructs t
        modus-themes-bold-constructs nil
        modus-themes-org-blocks nil
        modus-themes-completions '((t . (extrabold)))
        modus-themes-prompts '(extrabold)
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">   modus-themes-headings</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">   '((agenda-structure . (variable-pitch light 2.2))</span>
  <span style="color: #595959; font-style: italic;">;;         </span><span style="color: #595959; font-style: italic;">(agenda-date . (variable-pitch regular 1.3))</span>
  <span style="color: #595959; font-style: italic;">;;         </span><span style="color: #595959; font-style: italic;">(t . (regular 1.15))))</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq </span>
   modus-themes-common-palette-overrides nil
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">'((bg-mode-line-active bg-cyan-subtle)</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">(keybind yellow-warmer))</span>
         )


  <span style="color: #8f0075;">:bind</span> (<span style="color: #3548cf;">"&lt;f5&gt;"</span> . modus-themes-toggle)

  <span style="color: #8f0075;">:config</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Load the theme of your choice:</span>
  (load-theme 'modus-operandi-tinted <span style="color: #8f0075;">:no-confirm</span>)
  (modus-themes-select 'modus-operandi-tinted)
  )
</pre>
</div>

<p>
Emacs configurations
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Using `use-package` to configure emacs, here emacs is a pseudo</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">package</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">emacs</span>
  <span style="color: #8f0075;">:bind*</span> (
          (<span style="color: #3548cf;">"M-o"</span> . ace-window)
          (<span style="color: #3548cf;">"C-x &lt;C-m&gt;"</span> . execute-extended-command)
          (<span style="color: #3548cf;">"C-c &lt;C-m&gt;"</span> . execute-extended-command) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Sloppy version</span>
          (<span style="color: #3548cf;">"C-h h"</span> . nil) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Disable the hello page</span>
          )

  <span style="color: #8f0075;">:custom</span>
  (user-full-name <span style="color: #3548cf;">"A.R.M"</span>)


  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Settings for the Cocoa port</span>
  (ns-alternate-modifier 'super)
  (ns-command-modifier 'meta)
  (ns-function-modifier 'hyper)
  (ns-right-alternate-modifier 'super)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Settings for the Emacs Mac-port</span>
  (mac-command-modifier 'meta)
  (mac-option-modifier 'super)
  (mac-pass-command-to-system nil)

  (frame-title-format
   '(<span style="color: #8f0075;">:eval</span>
     (concat
      (<span style="color: #531ab6;">if</span> buffer-file-name default-directory <span style="color: #3548cf;">"%b"</span>)
      <span style="color: #3548cf;">"    "</span>
      (number-to-string
       (cdr
        (assq 'width
              (frame-parameters))))
      <span style="color: #3548cf;">"x"</span>
      (number-to-string
       (cdr
        (assq 'height
              (frame-parameters)))))))

  (completion-cycle-threshold 7)
  (completion-ignored-extensions
   '(<span style="color: #3548cf;">".a"</span>
     <span style="color: #3548cf;">".aux"</span>
     <span style="color: #3548cf;">".bbl"</span>
     <span style="color: #3548cf;">".bin"</span>
     <span style="color: #3548cf;">".elc"</span>
     <span style="color: #3548cf;">".git/"</span>
     <span style="color: #3548cf;">".o"</span>
     <span style="color: #3548cf;">".pyc"</span>
     <span style="color: #3548cf;">".pyo"</span>
     <span style="color: #3548cf;">".so"</span>
     <span style="color: #3548cf;">".toc"</span>
     <span style="color: #3548cf;">"~"</span>))

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">startup.el</span>
  (auto-save-list-file-prefix (user-data <span style="color: #3548cf;">"auto-save-list/.saves-"</span>))
  (inhibit-startup-echo-area-message <span style="color: #3548cf;">"aziz"</span>)
  (inhibit-startup-screen t)
  (initial-buffer-choice t)
  (initial-major-mode 'fundamental-mode)
  (initial-scratch-message <span style="color: #3548cf;">""</span>)
  (user-mail-address <span style="color: #3548cf;">"abdalaziz.rashid@outlook.com"</span>)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">files.el</span>
  (auto-save-file-name-transforms '((<span style="color: #3548cf;">"\\`/[</span><span style="color: #a60000;">^</span><span style="color: #3548cf;">/]*:.*"</span> <span style="color: #3548cf;">"~/.emacs.d/auto-saves/"</span> t)))
  (backup-directory-alist '((<span style="color: #3548cf;">"."</span> . <span style="color: #3548cf;">"~/.local/share/emacs/backups"</span>)))
  (delete-old-versions t)
  (directory-abbrev-alist
   '((<span style="color: #3548cf;">"\\`/org"</span> . <span style="color: #3548cf;">"~/org"</span>)
     (<span style="color: #3548cf;">"\\`/home-manager"</span> . <span style="color: #3548cf;">"~/.config/home-manager"</span>)))
  (directory-free-space-args <span style="color: #3548cf;">"-kh"</span>)
  (large-file-warning-threshold nil)
  (save-abbrevs 'silently)
  (trash-directory <span style="color: #3548cf;">"~/.Trash"</span>)
  (version-control t)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">bytecomp.el</span>
  (byte-compile-verbose nil)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">scroll-bar.el</span>
  (scroll-bar-mode nil)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">paren.el</span>
  (show-paren-delay 0)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">window.el</span>
  (same-window-buffer-names
   '(<span style="color: #3548cf;">"*eshell*"</span>
     <span style="color: #3548cf;">"*shell*"</span>
     <span style="color: #3548cf;">"*mail*"</span>
     <span style="color: #3548cf;">"*inferior-lisp*"</span>
     <span style="color: #3548cf;">"*ielm*"</span>
     <span style="color: #3548cf;">"*scheme*"</span>))
  (switch-to-buffer-preserve-window-point t)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">warnings.el</span>
  (warning-minimum-log-level <span style="color: #8f0075;">:error</span>)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">frame.el</span>
  (window-divider-default-bottom-width 1)
  (window-divider-default-places 'bottom-only)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))


  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">mwheel.el</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">TODO: disable keybindings to  mouse-wheel-global-text-scale</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">and mouse-wheel-text-scale</span>
  (global-set-key (kbd <span style="color: #3548cf;">"&lt;C-wheel-up&gt;"</span>) nil)
  (global-set-key (kbd <span style="color: #3548cf;">"&lt;C-wheel-down&gt;"</span>) nil)

  (vc-follow-symlinks nil)
  <span style="color: #8f0075;">:init</span>
  (<span style="color: #531ab6;">setq</span> disabled-command-function nil) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">enable all commands</span>


  <span style="color: #8f0075;">:config</span>  
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Setup font</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(advice-add 'server-create-window-system-frame</span>
  <span style="color: #595959; font-style: italic;">;;              </span><span style="color: #595959; font-style: italic;">:after 'my/setup-fonts)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(advice-add 'server-create-tty-frame</span>
  <span style="color: #595959; font-style: italic;">;;              </span><span style="color: #595959; font-style: italic;">:after 'my/setup-fonts)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(unless (daemonp) (my/setup-fonts))</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">;; En</span>
  able line numbers only with programing modes
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(add-hook 'prog-mode-hook (lambda () (</span>
  <span style="color: #595959; font-style: italic;">;;           </span><span style="color: #595959; font-style: italic;">display-line-numbers-mode</span>
  <span style="color: #595959; font-style: italic;">;;           </span><span style="color: #595959; font-style: italic;">(setq-default display-line-numbers-type 'relative))))</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">This is an ugly hack the fix is upstream but hasn't been merge yet</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">https://github.com/doomemacs/doomemacs/issues/7532</span>
  (add-hook 'after-init-hook (<span style="color: #531ab6;">lambda</span> () 
                             (tool-bar-mode 1) 
                             (tool-bar-mode 0)))
  (<span style="color: #531ab6;">defun</span> <span style="color: #721045;">my-toggle-toolbar</span> (frame)
    <span style="color: #2a5045; font-style: italic;">"Toggle tool-bar-mode on then off when a new frame is created."</span>
    (<span style="color: #531ab6;">with-selected-frame</span> frame
      (tool-bar-mode 1)
      (tool-bar-mode 0)))

  (add-hook 'after-make-frame-functions 'my-toggle-toolbar)
  )
</pre>
</div>
</div>
