users/aziz/.config/emacs/az-emacs.org
** String processing
#+begin_src emacs-lisp :tangle "init.el"
  (use-package s)
#+end_src
** Async
Used by other packages such as org-ref
#+begin_src emacs-lisp :tangle "init.el"
  (use-package async)
#+end_src
** Tramp
#+begin_src emacs-lisp :tangle "init.el" :tangle no
  ;; Tramp
  ;;;; https://www.gnu.org/software/emacs/manual/html_node/tramp/Ssh-setup.html
  (use-package tramp
    :config
    (setq tramp-ssh-controlmaster-options
  	(concat
  	 "-o ControlMaster=auto "
  	 "-o ControlPath=~/tmp/.ssh-control-%%r-%%h-%%p"))
    (tramp-set-completion-function
     "ssh" (append (tramp-get-completion-function "ssh")
  		 (mapcar (lambda (file) `(tramp-parse-sconfig ,file))
  			 (directory-files
                            "~/.ssh/conf.d/"
                            'full directory-files-no-dot-files-regexp))))

    (setq tramp-default-method "ssh")
    (add-hook 'helm-tramp-pre-command-hook '(lambda () (global-aggressive-indent-mode 0)
  					    (projectile-mode 0)
  					    ;;(editorconfig-mode 0)
  					    ))
    (add-hook 'helm-tramp-quit-hook '(lambda () (global-aggressive-indent-mode 1)
  				     (projectile-mode 1)
  				     ;;(editorconfig-mode 1)
  				     ))
    (setq make-backup-files nil)
    (setq create-lockfiles nil)
    :custom
    (custom-set-variables  '(tramp-remote-path
                             (quote
                              (tramp-own-remote-path))))
    (debug-ignored-errors
     (cons 'remote-file-error debug-ignored-errors))
    (tramp-lock-file-name-transforms
     '(("\\`\\(.+\\)\\'" "\\1~"))))
#+end_src

* Font configuration
I use ~fontaine~ a package allows the user to define detailed font
configurations and set them on demand. For example, one can have a
regular-editing preset and another for presentation-mode (these are
arbitrary, user-defined symbols): the former uses small fonts which
are optimised for writing, while the latter applies typefaces that are
pleasant to read at comfortable point sizes.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package fontaine
    :config
    (setq fontaine-presets
          '((small
             :default-family "Berkeley Mono"
             :default-height 80
             :variable-pitch-family "Berkeley Mono")
            (regular) ; like this it uses all the fallback values and is named `regular'
            (medium
             :default-weight semilight
             :default-height 115
             :bold-weight extrabold)
            (large
             :inherit medium
             :default-height 150)
            (presentation
             :inherit medium
             :default-weight light
             :default-height 180)
            (t
             ;; I keep all properties for didactic purposes, but most can be
             ;; omitted.  See the fontaine manual for the technicalities:
             ;; <https://protesilaos.com/emacs/fontaine>.
             :default-family "Berkeley Mono"
             :default-weight regular
             :default-height 100
             :fixed-pitch-family nil ; falls back to :default-family
             :fixed-pitch-weight nil ; falls back to :default-weight
             :fixed-pitch-height 1.0
             :fixed-pitch-serif-family nil ; falls back to :default-family
             :fixed-pitch-serif-weight nil ; falls back to :default-weight
             :fixed-pitch-serif-height 1.0
             :variable-pitch-family "Berkeley Mono"
             :variable-pitch-weight nil
             :variable-pitch-height 1.0
             :bold-family nil ; use whatever the underlying face has
             :bold-weight bold
             :italic-family nil
             :italic-slant italic
             :line-spacing nil)))

    ;; Set last preset or fall back to desired style from `fontaine-presets'.
    (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))

    ;; The other side of `fontaine-restore-latest-preset'.
    (add-hook 'kill-emacs-hook #'fontaine-store-latest-preset)

    ;; Persist font configurations while switching themes.  The
    ;; `enable-theme-functions' is from Emacs 29.
    (add-hook 'enable-theme-functions #'fontaine-apply-current-preset)

  )
#+end_src

* Completion
