users/aziz/blog/az-emacs.html
<div id="outline-container-org3865e1f" class="outline-3">
<h3 id="org3865e1f"><span class="section-number-3">2.1.</span> String processing</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">s</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9a3226" class="outline-3">
<h3 id="orgb9a3226"><span class="section-number-3">2.2.</span> Asyn</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Used by other packages such as org-ref
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">async</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org52c2b62" class="outline-3">
<h3 id="org52c2b62"><span class="section-number-3">2.3.</span> Tramp</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Tramp</span>
<span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">https://www.gnu.org/software/emacs/manual/html_node/tramp/Ssh-setup.html</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">tramp</span>
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">setq</span> tramp-ssh-controlmaster-options
        (concat
         <span style="color: #3548cf;">"-o ControlMaster=auto "</span>
         <span style="color: #3548cf;">"-o ControlPath=~/tmp/.ssh-control-%%r-%%h-%%p"</span>))
  (tramp-set-completion-function
   <span style="color: #3548cf;">"ssh"</span> (append (tramp-get-completion-function <span style="color: #3548cf;">"ssh"</span>)
                 (mapcar (<span style="color: #531ab6;">lambda</span> (file) `(tramp-parse-sconfig ,file))
                         (directory-files
                          <span style="color: #3548cf;">"~/.ssh/conf.d/"</span>
                          'full directory-files-no-dot-files-regexp))))

  (<span style="color: #531ab6;">setq</span> tramp-default-method <span style="color: #3548cf;">"ssh"</span>)
  (add-hook 'helm-tramp-pre-command-hook '(lambda () (global-aggressive-indent-mode 0)
                                            (projectile-mode 0)
                                            <span style="color: #595959; font-style: italic;">;;</span><span style="color: #595959; font-style: italic;">(editorconfig-mode 0)</span>
                                            ))
  (add-hook 'helm-tramp-quit-hook '(lambda () (global-aggressive-indent-mode 1)
                                     (projectile-mode 1)
                                     <span style="color: #595959; font-style: italic;">;;</span><span style="color: #595959; font-style: italic;">(editorconfig-mode 1)</span>
                                     ))
  (<span style="color: #531ab6;">setq</span> make-backup-files nil)
  (<span style="color: #531ab6;">setq</span> create-lockfiles nil)
  <span style="color: #8f0075;">:custom</span>
  (custom-set-variables  '(tramp-remote-path
                           (<span style="color: #531ab6;">quote</span>
                            (tramp-own-remote-path))))
  (debug-ignored-errors
   (cons 'remote-file-error debug-ignored-errors))
  (tramp-lock-file-name-transforms
   '((<span style="color: #3548cf;">"\\`</span><span style="color: #721045;">\\</span><span style="color: #00663f;">(</span><span style="color: #3548cf;">.+</span><span style="color: #721045;">\\</span><span style="color: #00663f;">)</span><span style="color: #3548cf;">\\'"</span> <span style="color: #3548cf;">"\\1~"</span>))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb2f6885" class="outline-2">
<h2 id="orgb2f6885"><span class="section-number-2">3.</span> Font configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
I use <code>fontaine</code> a package allows the user to define detailed font
configurations and set them on demand. For example, one can have a
regular-editing preset and another for presentation-mode (these are
arbitrary, user-defined symbols): the former uses small fonts which
are optimised for writing, while the latter applies typefaces that are
pleasant to read at comfortable point sizes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">fontaine</span>
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">setq</span> fontaine-presets
        '((small
           <span style="color: #8f0075;">:default-family</span> <span style="color: #3548cf;">"Berkeley Mono"</span>
           <span style="color: #8f0075;">:default-height</span> 80
           <span style="color: #8f0075;">:variable-pitch-family</span> <span style="color: #3548cf;">"Berkeley Mono"</span>)
          (regular) <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">like this it uses all the fallback values and is named `</span><span style="color: #0000b0; font-style: italic;">regular</span><span style="color: #595959; font-style: italic;">'</span>
          (medium
           <span style="color: #8f0075;">:default-weight</span> semilight
           <span style="color: #8f0075;">:default-height</span> 115
           <span style="color: #8f0075;">:bold-weight</span> extrabold)
          (large
           <span style="color: #8f0075;">:inherit</span> medium
           <span style="color: #8f0075;">:default-height</span> 150)
          (presentation
           <span style="color: #8f0075;">:inherit</span> medium
           <span style="color: #8f0075;">:default-weight</span> light
           <span style="color: #8f0075;">:default-height</span> 180)
          (t
           <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">I keep all properties for didactic purposes, but most can be</span>
           <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">omitted.  See the fontaine manual for the technicalities:</span>
           <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;"><a href="https://protesilaos.com/emacs/fontaine">&lt;https://protesilaos.com/emacs/fontaine&gt;</a>.</span>
           <span style="color: #8f0075;">:default-family</span> <span style="color: #3548cf;">"Berkeley Mono"</span>
           <span style="color: #8f0075;">:default-weight</span> regular
           <span style="color: #8f0075;">:default-height</span> 100
           <span style="color: #8f0075;">:fixed-pitch-family</span> nil <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">falls back to :default-family</span>
           <span style="color: #8f0075;">:fixed-pitch-weight</span> nil <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">falls back to :default-weight</span>
           <span style="color: #8f0075;">:fixed-pitch-height</span> 1.0
           <span style="color: #8f0075;">:fixed-pitch-serif-family</span> nil <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">falls back to :default-family</span>
           <span style="color: #8f0075;">:fixed-pitch-serif-weight</span> nil <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">falls back to :default-weight</span>
           <span style="color: #8f0075;">:fixed-pitch-serif-height</span> 1.0
           <span style="color: #8f0075;">:variable-pitch-family</span> <span style="color: #3548cf;">"Berkeley Mono"</span>
           <span style="color: #8f0075;">:variable-pitch-weight</span> nil
           <span style="color: #8f0075;">:variable-pitch-height</span> 1.0
           <span style="color: #8f0075;">:bold-family</span> nil <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">use whatever the underlying face has</span>
           <span style="color: #8f0075;">:bold-weight</span> bold
           <span style="color: #8f0075;">:italic-family</span> nil
           <span style="color: #8f0075;">:italic-slant</span> italic
           <span style="color: #8f0075;">:line-spacing</span> nil)))

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Set last preset or fall back to desired style from `</span><span style="color: #0000b0; font-style: italic;">fontaine-presets</span><span style="color: #595959; font-style: italic;">'.</span>
  (fontaine-set-preset (<span style="color: #531ab6;">or</span> (fontaine-restore-latest-preset) 'regular))

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">The other side of `</span><span style="color: #0000b0; font-style: italic;">fontaine-restore-latest-preset</span><span style="color: #595959; font-style: italic;">'.</span>
  (add-hook 'kill-emacs-hook #'fontaine-store-latest-preset)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Persist font configurations while switching themes.  The</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">`</span><span style="color: #0000b0; font-style: italic;">enable-theme-functions</span><span style="color: #595959; font-style: italic;">' is from Emacs 29.</span>
  (add-hook 'enable-theme-functions #'fontaine-apply-current-preset)

)
</pre>
</div>
</div>
</div>
