users/aziz/blog/az-emacs.html
<div id="outline-container-orga9564e5" class="outline-2">
<h2 id="orga9564e5"><span class="section-number-2">4.</span> Completion</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org6edc700" class="outline-3">
<h3 id="org6edc700"><span class="section-number-3">4.1.</span> vetico</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Enable vertico</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">vertico</span>
  <span style="color: #8f0075;">:init</span>
  (vertico-mode)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Different scroll margin</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq vertico-scroll-margin 0)</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Show more candidates</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq vertico-count 20)</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Grow and shrink the Vertico minibuffer</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq vertico-resize t)</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally enable cycling for `</span><span style="color: #0000b0; font-style: italic;">vertico-next</span><span style="color: #595959; font-style: italic;">' and `</span><span style="color: #0000b0; font-style: italic;">vertico-previous</span><span style="color: #595959; font-style: italic;">'.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq vertico-cycle t)</span>
  )

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Persist history over Emacs restarts. Vertico sorts by history position.</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">savehist</span>
  <span style="color: #8f0075;">:init</span>
  (savehist-mode))

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">A few more useful configurations...</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">emacs</span>
  <span style="color: #8f0075;">:init</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Add prompt indicator to `</span><span style="color: #0000b0; font-style: italic;">completing-read-multiple</span><span style="color: #595959; font-style: italic;">'.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">We display [CRM&lt;separator&gt;], e.g., [CRM,] if the separator is a comma.</span>
  (<span style="color: #531ab6;">defun</span> <span style="color: #721045;">crm-indicator</span> (args)
    (cons (format <span style="color: #3548cf;">"[CRM%s] %s"</span>
                  (replace-regexp-in-string
                   <span style="color: #3548cf;">"\\`\\[</span><span style="color: #0000b0;">.*?</span><span style="color: #3548cf;">]\\*</span><span style="color: #721045;">\\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">\\[</span><span style="color: #0000b0;">.*?</span><span style="color: #3548cf;">]\\*\\'"</span> <span style="color: #3548cf;">""</span>
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple <span style="color: #8f0075;">:filter-args</span> #'crm-indicator)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Do not allow the cursor in the minibuffer prompt</span>
  (<span style="color: #531ab6;">setq</span> minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Support opening new minibuffers from inside existing minibuffers.</span>
  (<span style="color: #531ab6;">setq</span> enable-recursive-minibuffers t)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Emacs 28 and newer: Hide commands in M-x which do not work in the current</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">mode.  Vertico commands are hidden in normal buffers. This setting is</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">useful beyond Vertico.</span>
  (<span style="color: #531ab6;">setq</span> read-extended-command-predicate #'command-completion-default-include-p))
</pre>
</div>
</div>
</div>
<div id="outline-container-org34cee77" class="outline-3">
<h3 id="org34cee77"><span class="section-number-3">4.2.</span> corfu</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Corfu enhances in-buffer completion with a small completion popup. The
current candidates are shown in a popup below or above the point. The
candidates can be selected by moving up and down. Corfu is the
minimalistic in-buffer completion counterpart of the Vertico
minibuffer UI. 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">corfu</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optional customizations</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">:custom</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-cycle t)                ;; Enable cycling for `</span><span style="color: #0000b0; font-style: italic;">corfu-next/previous</span><span style="color: #595959; font-style: italic;">'</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-auto t)                 ;; Enable auto completion</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-separator ?\s)          ;; Orderless field separator</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-quit-at-boundary nil)   ;; Never quit at completion boundary</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-quit-no-match nil)      ;; Never quit, even if there is no match</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-preview-current nil)    ;; Disable current candidate preview</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-preselect 'prompt)      ;; Preselect the prompt</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-on-exact-match nil)     ;; Configure handling of exact matches</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(corfu-scroll-margin 5)        ;; Use scroll margin</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Enable Corfu only for certain modes.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">:hook ((prog-mode . corfu-mode)</span>
  <span style="color: #595959; font-style: italic;">;;        </span><span style="color: #595959; font-style: italic;">(shell-mode . corfu-mode)</span>
  <span style="color: #595959; font-style: italic;">;;        </span><span style="color: #595959; font-style: italic;">(eshell-mode . corfu-mode))</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Recommended: Enable Corfu globally.  This is recommended since Dabbrev can</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">be used globally (M-/).  See also the customization variable</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">`</span><span style="color: #0000b0; font-style: italic;">global-corfu-modes</span><span style="color: #595959; font-style: italic;">' to exclude certain modes.</span>
  <span style="color: #8f0075;">:init</span>
  (global-corfu-mode))

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">A few more useful configurations...</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">emacs</span>
  <span style="color: #8f0075;">:init</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">TAB cycle if there are only few candidates</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq completion-cycle-threshold 3)</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Enable indentation+completion using the TAB key.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">`</span><span style="color: #0000b0; font-style: italic;">completion-at-point</span><span style="color: #595959; font-style: italic;">' is often bound to M-TAB.</span>
  (<span style="color: #531ab6;">setq</span> tab-always-indent 'complete)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Emacs 30 and newer: Disable Ispell completion function. As an alternative,</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">try `</span><span style="color: #0000b0; font-style: italic;">cape-dict</span><span style="color: #595959; font-style: italic;">'.</span>
  (<span style="color: #531ab6;">setq</span> text-mode-ispell-word-completion nil)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Emacs 28 and newer: Hide commands in M-x which do not apply to the current</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">mode.  Corfu commands are hidden, since they are not used via M-x. This</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">setting is useful beyond Corfu.</span>
  (<span style="color: #531ab6;">setq</span> read-extended-command-predicate #'command-completion-default-include-p))
</pre>
</div>
</div>
</div>
