users/aziz/blog/az-emacs.html
<div id="outline-container-orgbe58c29" class="outline-3">
<h3 id="orgbe58c29"><span class="section-number-3">4.3.</span> orderless</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">Orderless</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">orderless</span>
  <span style="color: #8f0075;">:init</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Configure a custom style dispatcher (see the Consult wiki)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)</span>
  <span style="color: #595959; font-style: italic;">;;       </span><span style="color: #595959; font-style: italic;">orderless-component-separator #'orderless-escapable-split-on-space)</span>
  (<span style="color: #531ab6;">setq</span> completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion))))
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">defun</span> <span style="color: #721045;">prefixes-for-separators</span> (pattern _index _total)
    (<span style="color: #531ab6;">when</span> (string-match-p <span style="color: #3548cf;">"^[</span><span style="color: #a60000;">^</span><span style="color: #3548cf;">][</span><span style="color: #a60000;">^</span><span style="color: #3548cf;">\\+*]*[./-][</span><span style="color: #a60000;">^</span><span style="color: #3548cf;">][\\+*$]*$"</span> pattern)
      (cons 'orderless-prefixes pattern)))
  (<span style="color: #531ab6;">cl-pushnew</span> '(?` . orderless-regexp) orderless-affix-dispatch-alist)
  <span style="color: #8f0075;">:custom</span>
  (orderless-style-dispatchers
   '(orderless-affix-dispatch prefixes-for-separators))
  )

</pre>
</div>
</div>
</div>
<div id="outline-container-orge40f847" class="outline-3">
<h3 id="orge40f847"><span class="section-number-3">4.4.</span> embark</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">embark</span>
  <span style="color: #8f0075;">:bind</span>
  ((<span style="color: #3548cf;">"C-."</span> . embark-act)         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">pick some comfortable binding</span>
   (<span style="color: #3548cf;">"C-;"</span> . embark-dwim)        <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">good alternative: M-.</span>
   (<span style="color: #3548cf;">"C-h B"</span> . embark-bindings)) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">alternative for `</span><span style="color: #0000b0; font-style: italic;">describe-bindings</span><span style="color: #595959; font-style: italic;">'</span>

  <span style="color: #8f0075;">:init</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally replace the key help with a completing-read interface</span>
  (<span style="color: #531ab6;">setq</span> prefix-help-command #'embark-prefix-help-command)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Show the Embark target at point via Eldoc. You may adjust the</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Eldoc strategy, if you want to see the documentation from</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">multiple providers. Beware that using this can be a little</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">jarring since the message shown in the minibuffer can be more</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">than one line, causing the modeline to move up and down:</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)</span>

  <span style="color: #8f0075;">:config</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Hide the mode line of the Embark live/completions buffers</span>
  (add-to-list 'display-buffer-alist
               '(<span style="color: #3548cf;">"\\`\\*Embark Collect </span><span style="color: #721045;">\\</span><span style="color: #00663f;">(</span><span style="color: #3548cf;">Live</span><span style="color: #721045;">\\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">Completions</span><span style="color: #721045;">\\</span><span style="color: #00663f;">)</span><span style="color: #3548cf;">\\*"</span>
                 nil
                 (window-parameters (mode-line-format . none)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge25b7e6" class="outline-3">
<h3 id="orge25b7e6"><span class="section-number-3">4.5.</span> Marginalia</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Enable rich annotations using the Marginalia package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">marginalia</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Bind `</span><span style="color: #0000b0; font-style: italic;">marginalia-cycle</span><span style="color: #595959; font-style: italic;">' locally in the minibuffer.  To make the binding</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">available in the *Completions* buffer, add it to the</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">`</span><span style="color: #0000b0; font-style: italic;">completion-list-mode-map</span><span style="color: #595959; font-style: italic;">'.</span>
  <span style="color: #8f0075;">:bind</span> (<span style="color: #8f0075;">:map</span> minibuffer-local-map
         (<span style="color: #3548cf;">"M-A"</span> . marginalia-cycle))

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">The :init section is always executed.</span>
  <span style="color: #8f0075;">:init</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Marginalia must be activated in the :init section of use-package such that</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">the mode gets enabled right away. Note that this forces loading the</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">package.</span>
  (marginalia-mode))
</pre>
</div>
</div>
</div>
