users/aziz/blog/az-emacs.html
<div id="outline-container-org0ab5da5" class="outline-3">
<h3 id="org0ab5da5"><span class="section-number-3">4.6.</span> <span class="todo TODO">TODO</span> ivy</h3>
</div>
<div id="outline-container-orge7ad08b" class="outline-3">
<h3 id="orge7ad08b"><span class="section-number-3">4.7.</span> consult</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Example configuration for Consult</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">consult</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Replace bindings. Lazily loaded due by `</span><span style="color: #0000b0; font-style: italic;">use-package</span><span style="color: #595959; font-style: italic;">'.</span>
  <span style="color: #8f0075;">:bind</span> (<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">C-c bindings in `</span><span style="color: #0000b0; font-style: italic;">mode-specific-map</span><span style="color: #595959; font-style: italic;">'</span>
         (<span style="color: #3548cf;">"C-c M-x"</span> . consult-mode-command)
         (<span style="color: #3548cf;">"C-c h"</span> . consult-history)
         (<span style="color: #3548cf;">"C-c k"</span> . consult-kmacro)
         (<span style="color: #3548cf;">"C-c m"</span> . consult-man)
         (<span style="color: #3548cf;">"C-c i"</span> . consult-info)
         ([remap Info-search] . consult-info)
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">C-x bindings in `</span><span style="color: #0000b0; font-style: italic;">ctl-x-map</span><span style="color: #595959; font-style: italic;">'</span>
         (<span style="color: #3548cf;">"C-x M-:"</span> . consult-complex-command)     <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. repeat-complex-command</span>
         (<span style="color: #3548cf;">"C-x b"</span> . consult-buffer)                <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. switch-to-buffer</span>
         (<span style="color: #3548cf;">"C-x 4 b"</span> . consult-buffer-other-window) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. switch-to-buffer-other-window</span>
         (<span style="color: #3548cf;">"C-x 5 b"</span> . consult-buffer-other-frame)  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. switch-to-buffer-other-frame</span>
         (<span style="color: #3548cf;">"C-x t b"</span> . consult-buffer-other-tab)    <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. switch-to-buffer-other-tab</span>
         (<span style="color: #3548cf;">"C-x r b"</span> . consult-bookmark)            <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. bookmark-jump</span>
         (<span style="color: #3548cf;">"C-x p b"</span> . consult-project-buffer)      <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. project-switch-to-buffer</span>
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Custom M-# bindings for fast register access</span>
         (<span style="color: #3548cf;">"M-#"</span> . consult-register-load)
         (<span style="color: #3548cf;">"M-'"</span> . consult-register-store)          <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. abbrev-prefix-mark (unrelated)</span>
         (<span style="color: #3548cf;">"C-M-#"</span> . consult-register)
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Other custom bindings</span>
         (<span style="color: #3548cf;">"M-y"</span> . consult-yank-pop)                <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. yank-pop</span>
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">M-g bindings in `</span><span style="color: #0000b0; font-style: italic;">goto-map</span><span style="color: #595959; font-style: italic;">'</span>
         (<span style="color: #3548cf;">"M-g e"</span> . consult-compile-error)
         (<span style="color: #3548cf;">"M-g f"</span> . consult-flymake)               <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Alternative: consult-flycheck</span>
         (<span style="color: #3548cf;">"M-g g"</span> . consult-goto-line)             <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. goto-line</span>
         (<span style="color: #3548cf;">"M-g M-g"</span> . consult-goto-line)           <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. goto-line</span>
         (<span style="color: #3548cf;">"M-g o"</span> . consult-outline)               <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Alternative: consult-org-heading</span>
         (<span style="color: #3548cf;">"M-g m"</span> . consult-mark)
         (<span style="color: #3548cf;">"M-g k"</span> . consult-global-mark)
         (<span style="color: #3548cf;">"M-g i"</span> . consult-imenu)
         (<span style="color: #3548cf;">"M-g I"</span> . consult-imenu-multi)
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">M-s bindings in `</span><span style="color: #0000b0; font-style: italic;">search-map</span><span style="color: #595959; font-style: italic;">'</span>
         (<span style="color: #3548cf;">"M-s d"</span> . consult-fd)                  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Alternative: consult-fd</span>
         (<span style="color: #3548cf;">"M-s c"</span> . consult-locate)
         (<span style="color: #3548cf;">"M-s g"</span> . consult-grep)
         (<span style="color: #3548cf;">"M-s G"</span> . consult-git-grep)
         (<span style="color: #3548cf;">"M-s r"</span> . consult-ripgrep)
         (<span style="color: #3548cf;">"M-s l"</span> . consult-line)
         (<span style="color: #3548cf;">"M-s L"</span> . consult-line-multi)
         (<span style="color: #3548cf;">"M-s k"</span> . consult-keep-lines)
         (<span style="color: #3548cf;">"M-s u"</span> . consult-focus-lines)
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Isearch integration</span>
         (<span style="color: #3548cf;">"M-s e"</span> . consult-isearch-history)
         <span style="color: #8f0075;">:map</span> isearch-mode-map
         (<span style="color: #3548cf;">"M-e"</span> . consult-isearch-history)         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. isearch-edit-string</span>
         (<span style="color: #3548cf;">"M-s e"</span> . consult-isearch-history)       <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. isearch-edit-string</span>
         (<span style="color: #3548cf;">"M-s l"</span> . consult-line)                  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">needed by consult-line to detect isearch</span>
         (<span style="color: #3548cf;">"M-s L"</span> . consult-line-multi)            <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">needed by consult-line to detect isearch</span>
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Minibuffer history</span>
         <span style="color: #8f0075;">:map</span> minibuffer-local-map
         (<span style="color: #3548cf;">"M-s"</span> . consult-history)                 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. next-matching-history-element</span>
         (<span style="color: #3548cf;">"M-r"</span> . consult-history))                <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">orig. previous-matching-history-element</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Enable automatic preview at point in the *Completions* buffer. This is</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">relevant when you use the default completion UI.</span>
  <span style="color: #8f0075;">:hook</span> (completion-list-mode . consult-preview-at-point-mode)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">The :init configuration is always executed (Not lazy)</span>
  <span style="color: #8f0075;">:init</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally configure the register formatting. This improves the register</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">preview for `</span><span style="color: #0000b0; font-style: italic;">consult-register</span><span style="color: #595959; font-style: italic;">', `</span><span style="color: #0000b0; font-style: italic;">consult-register-load</span><span style="color: #595959; font-style: italic;">',</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">`</span><span style="color: #0000b0; font-style: italic;">consult-register-store</span><span style="color: #595959; font-style: italic;">' and the Emacs built-ins.</span>
  (<span style="color: #531ab6;">setq</span> register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally tweak the register preview window.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">This adds thin lines, sorting and hides the mode line of the window.</span>
  (advice-add #'register-preview <span style="color: #8f0075;">:override</span> #'consult-register-window)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Use Consult to select xref locations with preview</span>
  (<span style="color: #531ab6;">setq</span> xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Configure other variables and modes in the :config section,</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">after lazily loading the package.</span>
  <span style="color: #8f0075;">:config</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally configure preview. The default value</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">is 'any, such that any key triggers the preview.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-preview-key 'any)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-preview-key "M-.")</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-preview-key '("S-&lt;down&gt;" "S-&lt;up&gt;"))</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">For some commands and buffer sources it is useful to configure the</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">:preview-key on a per-command basis using the `</span><span style="color: #0000b0; font-style: italic;">consult-customize</span><span style="color: #595959; font-style: italic;">' macro.</span>
  (<span style="color: #531ab6;">consult-customize</span>
   consult-theme <span style="color: #8f0075;">:preview-key</span> '(<span style="color: #8f0075;">:debounce</span> 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">:preview-key "M-."</span>
   <span style="color: #8f0075;">:preview-key</span> '(<span style="color: #8f0075;">:debounce</span> 0.4 any))

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally configure the narrowing key.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Both &lt; and C-+ work reasonably well.</span>
  (<span style="color: #531ab6;">setq</span> consult-narrow-key <span style="color: #3548cf;">"&lt;"</span>) <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">"C-+"</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally make narrowing help available in the minibuffer.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">You may want to use `</span><span style="color: #0000b0; font-style: italic;">embark-prefix-help-command</span><span style="color: #595959; font-style: italic;">' or which-key instead.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">By default `</span><span style="color: #0000b0; font-style: italic;">consult-project-function</span><span style="color: #595959; font-style: italic;">' uses `</span><span style="color: #0000b0; font-style: italic;">project-root</span><span style="color: #595959; font-style: italic;">' from project.el.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Optionally configure a different project root function.</span>
  <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">1. project.el (the default)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-project-function #'consult--default-project--function)</span>
  <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">2. vc.el (vc-root-dir)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-project-function (lambda (_) (vc-root-dir)))</span>
  <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">3. locate-dominating-file</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))</span>
  <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">4. projectile.el (projectile-project-root)</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(autoload 'projectile-project-root "projectile")</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-project-function (lambda (_) (projectile-project-root)))</span>
  <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">5. No project support</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq consult-project-function nil)</span>

  (add-to-list 'consult-fd-args <span style="color: #3548cf;">"--hidden"</span> t)
  (add-to-list 'consult-fd-args <span style="color: #3548cf;">"--exclude .git"</span> t)
  )

</pre>
</div>
<p>
The package embark-consult should be installed if you use both Embark and Consult
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">embark-consult</span>)
</pre>
</div>
</div>
</div>
