users/aziz/.config/emacs/az-emacs.org
** Helm
#+begin_src emacs-lisp 
  ;;;; Helm
  (use-package helm-rg
  :straight t)

  (use-package helm-projectile
    :straight t
    :config
    (helm-projectile-on))


  (use-package helm-tramp
    :straight t
    :config
    (define-key global-map (kbd "C-c s") 'helm-tramp))

  (use-package helm-org-rifle
     :straight t)

  (use-package helm-bibtex
    :straight t
    :config)

  (use-package helm
    :straight t
    :demand t
    :config
    (require 'helm-source)

    (global-set-key (kbd "M-x") #'helm-M-x)
    (global-set-key (kbd "C-x m") #'helm-M-x)
    (global-set-key (kbd "C-c m") #'helm-M-x)
    (global-set-key (kbd "C-x r b") #'helm-filtered-bookmarks)
    (global-set-key (kbd "C-x C-f") #'helm-find-files)
    (global-set-key (kbd "C-c i n") #'helm-complete-file-name-at-point)
    (global-set-key (kbd "C-x i") #'helm-imenu)
    (global-set-key (kbd "C-x b") 'helm-mini)
    (global-set-key (kbd "C-h SPC") 'helm-all-mark-rings)
    (global-set-key (kbd "C-c h x") 'helm-register)
    (global-set-key (kbd "C-c h M-:") 'helm-eval-expression-with-eldoc)

    (setq helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match    t)

    ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
    ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
    ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
    (global-set-key (kbd "C-c h") 'helm-command-prefix)
    (global-unset-key (kbd "C-x c"))

    (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
    (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB work in terminal
    (define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z


    (when (executable-find "curl")
      (setq helm-google-suggest-use-curl-p t))

    ; open helm buffer inside current window, not occupy whole other window
    (setq helm-split-window-in-side-p           t
          ; move to end or beginning of source when reaching top or bottom of source.
          helm-move-to-line-cycle-in-source     t
          ; search for library in `require' and `declare-function' sexp.
          helm-ff-search-library-in-sexp        t
          ; scroll 8 lines other window using M-<next>/M-<prior>
          helm-scroll-amount                    8
          helm-ff-file-name-history-use-recentf t
          helm-echo-input-in-header-line t)

    (defun spacemacs//helm-hide-minibuffer-maybe ()
      "Hide minibuffer in Helm session if we use the header line as input field."
      (when (with-helm-buffer helm-echo-input-in-header-line)
        (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
          (overlay-put ov 'window (selected-window))
          (overlay-put ov 'face
                       (let ((bg-color (face-background 'default nil)))
                         `(:background ,bg-color :foreground ,bg-color)))
          (setq-local cursor-type nil))))

    ;; (when (executable-find "ack-grep")
    ;; (setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
    ;;       helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f"))

    (add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)

    (add-hook 'helm-minibuffer-set-up-hook
              'spacemacs//helm-hide-minibuffer-maybe)

    (setq helm-autoresize-max-height 0)
    (setq helm-autoresize-min-height 40)
    (helm-autoresize-mode 1)



    (setq helm-completion-style 'helm)
    (setq helm-M-x-fuzzy-match t)
    (setq helm-apropos-fuzzy-match t)
    (setq helm-lisp-fuzzy-completion t)
    (helm-mode t)
    )
    #+end_src
** ido
#+begin_src emacs-lisp
  ;;;; ido
  (use-package ido
    :config
    (setq ido-enable-flex-matching t)
    (ido-mode t)
    ;;(setq ido-everywhere t)
#+end_src
** Avy
#+begin_src emacs-lisp :tangle "init.el"
  (use-package avy
    :straight t
    :config
    (avy-setup-default)
    :bind
    (("C-:" . avy-goto-char)
     ("C-'" . avy-goto-char-2)
     ("M-g f" . avy-goto-line)
     ("M-g w" . avy-goto-word-1)
     ("M-g e" . avy-goto-word-0)
     ("C-c C-j" . avy-resume)))
#+end_src
* Knowledge management
