users/aziz/blog/az-emacs.html
<div id="outline-container-orga00864b" class="outline-3">
<h3 id="orga00864b"><span class="section-number-3">4.8.</span> Helm</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">Helm</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">helm-rg</span>
<span style="color: #8f0075;">:straight</span> t)

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">helm-projectile</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #8f0075;">:config</span>
  (helm-projectile-on))


(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">helm-tramp</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #8f0075;">:config</span>
  (define-key global-map (kbd <span style="color: #3548cf;">"C-c s"</span>) 'helm-tramp))

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">helm-org-rifle</span>
   <span style="color: #8f0075;">:straight</span> t)

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">helm-bibtex</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #8f0075;">:config</span>)

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">helm</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #8f0075;">:demand</span> t
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">helm-source</span>)

  (global-set-key (kbd <span style="color: #3548cf;">"M-x"</span>) #'helm-M-x)
  (global-set-key (kbd <span style="color: #3548cf;">"C-x m"</span>) #'helm-M-x)
  (global-set-key (kbd <span style="color: #3548cf;">"C-c m"</span>) #'helm-M-x)
  (global-set-key (kbd <span style="color: #3548cf;">"C-x r b"</span>) #'helm-filtered-bookmarks)
  (global-set-key (kbd <span style="color: #3548cf;">"C-x C-f"</span>) #'helm-find-files)
  (global-set-key (kbd <span style="color: #3548cf;">"C-c i n"</span>) #'helm-complete-file-name-at-point)
  (global-set-key (kbd <span style="color: #3548cf;">"C-x i"</span>) #'helm-imenu)
  (global-set-key (kbd <span style="color: #3548cf;">"C-x b"</span>) 'helm-mini)
  (global-set-key (kbd <span style="color: #3548cf;">"C-h SPC"</span>) 'helm-all-mark-rings)
  (global-set-key (kbd <span style="color: #3548cf;">"C-c h x"</span>) 'helm-register)
  (global-set-key (kbd <span style="color: #3548cf;">"C-c h M-:"</span>) 'helm-eval-expression-with-eldoc)

  (<span style="color: #531ab6;">setq</span> helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match    t)

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">The default "C-x c" is quite close to "C-x C-c", which quits Emacs.</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Changed to "C-c h". Note: We must set "C-c h" globally, because we</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">cannot change `</span><span style="color: #0000b0; font-style: italic;">helm-command-prefix-key</span><span style="color: #595959; font-style: italic;">' once `</span><span style="color: #0000b0; font-style: italic;">helm-config</span><span style="color: #595959; font-style: italic;">' is loaded.</span>
  (global-set-key (kbd <span style="color: #3548cf;">"C-c h"</span>) 'helm-command-prefix)
  (global-unset-key (kbd <span style="color: #3548cf;">"C-x c"</span>))

  (define-key helm-map (kbd <span style="color: #3548cf;">"&lt;tab&gt;"</span>) 'helm-execute-persistent-action) <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">rebind tab to run persistent action</span>
  (define-key helm-map (kbd <span style="color: #3548cf;">"C-i"</span>) 'helm-execute-persistent-action) <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">make TAB work in terminal</span>
  (define-key helm-map (kbd <span style="color: #3548cf;">"C-z"</span>)  'helm-select-action) <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">list actions using C-z</span>


  (<span style="color: #531ab6;">when</span> (executable-find <span style="color: #3548cf;">"curl"</span>)
    (<span style="color: #531ab6;">setq</span> helm-google-suggest-use-curl-p t))

  <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">open helm buffer inside current window, not occupy whole other window</span>
  (<span style="color: #531ab6;">setq</span> helm-split-window-in-side-p           t
        <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">move to end or beginning of source when reaching top or bottom of source.</span>
        helm-move-to-line-cycle-in-source     t
        <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">search for library in `</span><span style="color: #0000b0; font-style: italic;">require</span><span style="color: #595959; font-style: italic;">' and `</span><span style="color: #0000b0; font-style: italic;">declare-function</span><span style="color: #595959; font-style: italic;">' sexp.</span>
        helm-ff-search-library-in-sexp        t
        <span style="color: #595959; font-style: italic;">; </span><span style="color: #595959; font-style: italic;">scroll 8 lines other window using M-&lt;next&gt;/M-&lt;prior&gt;</span>
        helm-scroll-amount                    8
        helm-ff-file-name-history-use-recentf t
        helm-echo-input-in-header-line t)

  (<span style="color: #531ab6;">defun</span> <span style="color: #721045;">spacemacs//helm-hide-minibuffer-maybe</span> ()
    <span style="color: #2a5045; font-style: italic;">"Hide minibuffer in Helm session if we use the header line as input field."</span>
    (<span style="color: #531ab6;">when</span> (with-helm-buffer helm-echo-input-in-header-line)
      (<span style="color: #531ab6;">let</span> ((ov (make-overlay (point-min) (point-max) nil nil t)))
        (overlay-put ov 'window (selected-window))
        (overlay-put ov 'face
                     (<span style="color: #531ab6;">let</span> ((bg-color (face-background 'default nil)))
                       `(<span style="color: #8f0075;">:background</span> ,bg-color <span style="color: #8f0075;">:foreground</span> ,bg-color)))
        (<span style="color: #531ab6;">setq-local</span> cursor-type nil))))

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(when (executable-find "ack-grep")</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"</span>
  <span style="color: #595959; font-style: italic;">;;       </span><span style="color: #595959; font-style: italic;">helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f"))</span>

  (add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)

  (add-hook 'helm-minibuffer-set-up-hook
            'spacemacs//helm-hide-minibuffer-maybe)

  (<span style="color: #531ab6;">setq</span> helm-autoresize-max-height 0)
  (<span style="color: #531ab6;">setq</span> helm-autoresize-min-height 40)
  (helm-autoresize-mode 1)



  (<span style="color: #531ab6;">setq</span> helm-completion-style 'helm)
  (<span style="color: #531ab6;">setq</span> helm-M-x-fuzzy-match t)
  (<span style="color: #531ab6;">setq</span> helm-apropos-fuzzy-match t)
  (<span style="color: #531ab6;">setq</span> helm-lisp-fuzzy-completion t)
  (helm-mode t)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org566691c" class="outline-3">
<h3 id="org566691c"><span class="section-number-3">4.9.</span> ido</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">ido</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">ido</span>
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">setq</span> ido-enable-flex-matching t)
  (ido-mode t)
  <span style="color: #595959; font-style: italic;">;;</span><span style="color: #595959; font-style: italic;">(setq ido-everywhere t)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaca3164" class="outline-3">
<h3 id="orgaca3164"><span class="section-number-3">4.10.</span> Avy</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">avy</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #8f0075;">:config</span>
  (avy-setup-default)
  <span style="color: #8f0075;">:bind</span>
  ((<span style="color: #3548cf;">"C-:"</span> . avy-goto-char)
   (<span style="color: #3548cf;">"C-'"</span> . avy-goto-char-2)
   (<span style="color: #3548cf;">"M-g f"</span> . avy-goto-line)
   (<span style="color: #3548cf;">"M-g w"</span> . avy-goto-word-1)
   (<span style="color: #3548cf;">"M-g e"</span> . avy-goto-word-0)
   (<span style="color: #3548cf;">"C-c C-j"</span> . avy-resume)))
</pre>
</div>
</div>
</div>
</div>
