users/aziz/.config/emacs/az-emacs.org
** Hyperbole
I use hyperbole to control multiple aspects of emacs
#+begin_src emacs-lisp :tangle "init.el"
  ;;;; Hyperbole
  (use-package hyperbole
    :config
    (add-to-list 'Info-directory-list (concat hyperb:dir "man/"))
    (add-to-list 'hyrolo-file-list (concat org-directory "people.org"))
    (hyperbole-mode t)
    (add-hook 'hyperbole-init-hook
              (lambda ()
                (require 'org)
                (setq hyrolo-file-list (append (hyrolo-initialize-file-list)
                                               (list org-directory))))))
#+end_src
** Org mode
Org is the main component of knowledge management
#+begin_src emacs-lisp :tangle "init.el"
  ;;;; Org-mode
  (use-package org
    :init
    ;;;; org babel support for nix
    (use-package ob-nix)
    :bind
    ("C-c l" . 'org-store-link)
    ("C-c a" . 'org-agenda)
    ("C-c c" . 'org-capture)
    :hook (org-mode . auto-revert-mode)
    :config
    (require 'org-protocol)
    (setq auto-revert-verbose nil)
    (setq org-directory
          "~/Documents/org/")
    (setq org-log-done 'time)
    (setq org-agenda-files (list org-directory))
    (setq org-refile-use-outline-path 'file)
    (setq org-refile-targets '(
                               (nil :maxlevel . 5)
                               (org-agenda-files :maxlevel . 5)))
    (setq org-outline-path-complete-in-steps nil)
    (setq org-default-notes-file (concat org-directory "notes.org"))
    (setq org-capture-templates
          `(("i" "inbox" entry (file ,(concat org-directory "inbox.org"))
             "* TODO %?")
            ("l" "link" entry (file ,(concat org-directory "inbox.org"))
             "* TODO %(org-cliplink-capture)" :immediate-finish t)
            ("c" "org-protocol-capture" entry (file ,(concat org-directory "/inbox.org"))
             "* TODO [[%:link][%:description]]\n\n %i" :immediate-finish t)
            ("u" "URL capture from Safari" entry (
                                                  file+olp+datetree ,(concat org-directory "/links.org"))
             "* %i    :safari:url:\n%U\n\n")))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((nix . t)
       (shell . t)
       (python . t)))
    (setq org-preview-latex-default-process 'dvisvgm))

#+end_src
#+begin_src emacs-lisp :tangle "init.el"

  (use-package org-transclusion)

  (use-package org-noter
    :config
    (setq org-noter-auto-save-last-location t))

  (use-package org-ref
    :bind
    (:map org-mode-map
          ("C-c ]" . org-ref-insert-link))
    :config
    (require 'org-ref-arxiv)
    (require 'org-ref-scopus)
    (require 'org-ref-wos)
    :custom
    ;;  (bibtex-completion-bibliography '("~/Documents/bibliography.bib"))
    (bibtex-completion-bibliography '("~/Documents/library/inbox.bib"))
    (bibtex-completion-library-path '("~/Documents/library/"))
    (bibtex-completion-notes-path "~/Documents/library/notes/")
    (bibtex-completion-notes-template-multiple-files "*${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}:
   \n\nSee [[cite:&${=key=}]]\n")
    (bibtex-completion-additional-search-fields '(keywords))
    (bibtex-completion-display-formats '((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}
   ${journal:40}")
                                         (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}
   Chapter ${chapter:32}")
                                         (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}
   ${booktitle:40}")
                                         (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}
   ${booktitle:40}")
                                         (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}")))
    (bibtex-completion-pdf-open-function (lambda (fpath) (call-process "open" nil 0 nil fpath))))
#+end_src
*** TODO 3rd party importers
#+begin_src emacs-lisp :tangle "init.el"
  ;; (load "other_importers.el")
#+end_src

