users/aziz/blog/az-emacs.html
<div id="outline-container-org6a24392" class="outline-2">
<h2 id="org6a24392"><span class="section-number-2">5.</span> Knowledge management</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgaf3529e" class="outline-3">
<h3 id="orgaf3529e"><span class="section-number-3">5.1.</span> Hyperbole</h3>
<div class="outline-text-3" id="text-5-1">
<p>
I use hyperbole to control multiple aspects of emacs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">Hyperbole</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">hyperbole</span>
  <span style="color: #8f0075;">:config</span>
  (add-to-list 'Info-directory-list (concat hyperb:dir <span style="color: #3548cf;">"man/"</span>))
  (add-to-list 'hyrolo-file-list (concat org-directory <span style="color: #3548cf;">"people.org"</span>))
  (hyperbole-mode t)
  (add-hook 'hyperbole-init-hook
            (<span style="color: #531ab6;">lambda</span> ()
              (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">org</span>)
              (<span style="color: #531ab6;">setq</span> hyrolo-file-list (append (hyrolo-initialize-file-list)
                                             (list org-directory))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org45a9603" class="outline-3">
<h3 id="org45a9603"><span class="section-number-3">5.2.</span> Org mode</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Org is the main component of knowledge management
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">Org-mode</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">org</span>
  <span style="color: #8f0075;">:init</span>
  <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">org babel support for nix</span>
  (<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">ob-nix</span>)
  <span style="color: #8f0075;">:bind</span>
  (<span style="color: #3548cf;">"C-c l"</span> . 'org-store-link)
  (<span style="color: #3548cf;">"C-c a"</span> . 'org-agenda)
  (<span style="color: #3548cf;">"C-c c"</span> . 'org-capture)
  <span style="color: #8f0075;">:hook</span> (org-mode . auto-revert-mode)
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">org-protocol</span>)
  (<span style="color: #531ab6;">setq</span> auto-revert-verbose nil)
  (<span style="color: #531ab6;">setq</span> org-directory
        <span style="color: #3548cf;">"~/Documents/org/"</span>)
  (<span style="color: #531ab6;">setq</span> org-log-done 'time)
  (<span style="color: #531ab6;">setq</span> org-agenda-files (list org-directory))
  (<span style="color: #531ab6;">setq</span> org-refile-use-outline-path 'file)
  (<span style="color: #531ab6;">setq</span> org-refile-targets '(
                             (nil <span style="color: #8f0075;">:maxlevel</span> . 5)
                             (org-agenda-files <span style="color: #8f0075;">:maxlevel</span> . 5)))
  (<span style="color: #531ab6;">setq</span> org-outline-path-complete-in-steps nil)
  (<span style="color: #531ab6;">setq</span> org-default-notes-file (concat org-directory <span style="color: #3548cf;">"notes.org"</span>))
  (<span style="color: #531ab6;">setq</span> org-capture-templates
        `((<span style="color: #3548cf;">"i"</span> <span style="color: #3548cf;">"inbox"</span> entry (file ,(concat org-directory <span style="color: #3548cf;">"inbox.org"</span>))
           <span style="color: #3548cf;">"* TODO %?"</span>)
          (<span style="color: #3548cf;">"l"</span> <span style="color: #3548cf;">"link"</span> entry (file ,(concat org-directory <span style="color: #3548cf;">"inbox.org"</span>))
           <span style="color: #3548cf;">"* TODO %(org-cliplink-capture)"</span> <span style="color: #8f0075;">:immediate-finish</span> t)
          (<span style="color: #3548cf;">"c"</span> <span style="color: #3548cf;">"org-protocol-capture"</span> entry (file ,(concat org-directory <span style="color: #3548cf;">"/inbox.org"</span>))
           <span style="color: #3548cf;">"* TODO [[%:link][%:description]]\n\n %i"</span> <span style="color: #8f0075;">:immediate-finish</span> t)
          (<span style="color: #3548cf;">"u"</span> <span style="color: #3548cf;">"URL capture from Safari"</span> entry (
                                                file+olp+datetree ,(concat org-directory <span style="color: #3548cf;">"/links.org"</span>))
           <span style="color: #3548cf;">"* %i    :safari:url:\n%U\n\n"</span>)))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((nix . t)
     (shell . t)
     (python . t)))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">org-transclusion</span>)

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">org-noter</span>
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">setq</span> org-noter-auto-save-last-location t))

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">org-ref</span>
  <span style="color: #8f0075;">:bind</span>
  (<span style="color: #8f0075;">:map</span> org-mode-map
        (<span style="color: #3548cf;">"C-c ]"</span> . org-ref-insert-link))
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">org-ref-arxiv</span>)
  (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">org-ref-scopus</span>)
  (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">org-ref-wos</span>)
  <span style="color: #8f0075;">:custom</span>
  <span style="color: #595959; font-style: italic;">;;  </span><span style="color: #595959; font-style: italic;">(bibtex-completion-bibliography '("~/Documents/bibliography.bib"))</span>
  (bibtex-completion-bibliography '(<span style="color: #3548cf;">"~/Documents/library/inbox.bib"</span>))
  (bibtex-completion-library-path '(<span style="color: #3548cf;">"~/Documents/library/"</span>))
  (bibtex-completion-notes-path <span style="color: #3548cf;">"~/Documents/library/notes/"</span>)
  (bibtex-completion-notes-template-multiple-files <span style="color: #3548cf;">"*${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}:</span>
<span style="color: #3548cf;"> \n\nSee [[cite:&amp;${=key=}]]\n"</span>)
  (bibtex-completion-additional-search-fields '(keywords))
  (bibtex-completion-display-formats '((article       . <span style="color: #3548cf;">"${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}</span>
<span style="color: #3548cf;"> ${journal:40}"</span>)
                                       (inbook        . <span style="color: #3548cf;">"${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}</span>
<span style="color: #3548cf;"> Chapter ${chapter:32}"</span>)
                                       (incollection  . <span style="color: #3548cf;">"${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}</span>
<span style="color: #3548cf;"> ${booktitle:40}"</span>)
                                       (inproceedings . <span style="color: #3548cf;">"${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}</span>
<span style="color: #3548cf;"> ${booktitle:40}"</span>)
                                       (t             . <span style="color: #3548cf;">"${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"</span>)))
  (bibtex-completion-pdf-open-function (<span style="color: #531ab6;">lambda</span> (fpath) (call-process <span style="color: #3548cf;">"open"</span> nil 0 nil fpath))))
</pre>
</div>
</div>
<div id="outline-container-org83790ea" class="outline-4">
<h4 id="org83790ea"><span class="section-number-4">5.2.1.</span> <span class="todo TODO">TODO</span> 3rd party importers</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(load "other_importers.el")</span>
</pre>
</div>
</div>
</div>
