users/aziz/blog/az-emacs.html
<div id="outline-container-org9a77618" class="outline-4">
<h4 id="org9a77618"><span class="section-number-4">5.2.2.</span> Publishing</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">ox-publish</span>)
(<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">ox-html</span>)

(<span style="color: #531ab6;">setq</span> org-global-properties
      '((<span style="color: #3548cf;">"PUBLISH"</span> . <span style="color: #3548cf;">"yes no"</span>)))

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(defun blog/org-publish-headline-filter (backend)</span>
<span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">"Filter headlines based on the PUBLISH property before publishing.</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Only publish headlines with the property :PUBLISH: set to '</span><span style="color: #0000b0; font-style: italic;">yes</span><span style="color: #595959; font-style: italic;">'."</span>
<span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">(org-map-entries</span>
<span style="color: #595959; font-style: italic;">;;    </span><span style="color: #595959; font-style: italic;">(lambda ()</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(let ((publish (org-entry-get (point) "PUBLISH")))</span>
<span style="color: #595959; font-style: italic;">;;        </span><span style="color: #595959; font-style: italic;">(unless (and publish (string= publish "yes"))</span>
<span style="color: #595959; font-style: italic;">;;          </span><span style="color: #595959; font-style: italic;">(org-cut-subtree))))</span>
<span style="color: #595959; font-style: italic;">;;    </span><span style="color: #595959; font-style: italic;">nil 'file))</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(remove-hook 'org-export-before-processing-hook #'blog/org-publish-headline-filter)</span>

(<span style="color: #531ab6;">defun</span> <span style="color: #721045;">blog/org-publish-after-publish</span> (plist)
  <span style="color: #2a5045; font-style: italic;">"Open the browser to the published site after publishing."</span>
  (browse-url (concat <span style="color: #3548cf;">"file://"</span> (expand-file-name <span style="color: #3548cf;">"public/index.html"</span> site-dir))))

(<span style="color: #531ab6;">setq</span> org-html-head
      <span style="color: #3548cf;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"style.css\" /&gt;"</span>)
(<span style="color: #531ab6;">setq</span> org-html-validation-link nil)
(<span style="color: #531ab6;">setq</span> org-html-head-include-scripts <span style="color: #3548cf;">"&lt;script data-goatcounter=\"https://aziz.goatcounter.com/count\" async src=\"//gc.zgo.at/count.js\"&gt; &lt;/script&gt;"</span>)
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Use our own scripts</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">org-html-head-include-default-style nil ;; Use our own styles</span>
<span style="color: #595959; font-style: italic;">;;  </span><span style="color: #595959; font-style: italic;">org-html-head "&lt;link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" /&gt;"</span>



(<span style="color: #531ab6;">defvar</span> <span style="color: #005e8b;">site-dir</span> <span style="color: #3548cf;">"~/Documents/org/"</span>)
(<span style="color: #531ab6;">defvar</span> <span style="color: #005e8b;">publish-dir</span> <span style="color: #3548cf;">"~/tree-3/users/aziz/blog/"</span>)

(<span style="color: #531ab6;">setq</span> org-publish-project-alist
      `((<span style="color: #3548cf;">"blog-org-files"</span>
         <span style="color: #8f0075;">:base-directory</span> ,site-dir
         <span style="color: #8f0075;">:base-extension</span> <span style="color: #3548cf;">"org"</span>
         <span style="color: #8f0075;">:publishing-directory</span> ,publish-dir
         <span style="color: #8f0075;">:recursive</span> t
         <span style="color: #8f0075;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #8f0075;">:headline-levels</span> 4
         <span style="color: #8f0075;">:auto-preamble</span> t
         <span style="color: #8f0075;">:auto-sitemap</span> t
         <span style="color: #8f0075;">:exclude</span> <span style="color: #3548cf;">".*.org"</span>
         <span style="color: #8f0075;">:include</span> (<span style="color: #3548cf;">"pkg.org"</span>)
         <span style="color: #8f0075;">:html-postamble</span> nil
         <span style="color: #8f0075;">:section-numbers</span> nil
         <span style="color: #8f0075;">:sitemap-filename</span> <span style="color: #3548cf;">"index.org"</span>
         <span style="color: #595959; font-style: italic;">;;</span><span style="color: #595959; font-style: italic;">:sitemap-sort-files 'anti-chronologically</span>
         <span style="color: #8f0075;">:sitemap-title</span> <span style="color: #3548cf;">"Site map"</span>
         <span style="color: #8f0075;">:with-author</span> t
         <span style="color: #8f0075;">:with-date</span> t
         <span style="color: #8f0075;">:with-title</span> t
         <span style="color: #8f0075;">:with-toc</span> t
         <span style="color: #8f0075;">:makeindex</span> t
         <span style="color: #8f0075;">:completion-function</span> blog/org-publish-after-publish)

        (<span style="color: #3548cf;">"blog-static"</span>
         <span style="color: #8f0075;">:base-directory</span> ,site-dir
         <span style="color: #8f0075;">:base-extension</span> <span style="color: #3548cf;">"css</span><span style="color: #721045;">\\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">js</span><span style="color: #721045;">\\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">png</span><span style="color: #721045;">\\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">jpg</span><span style="color: #721045;">\\</span><span style="color: #00663f;">|</span><span style="color: #3548cf;">gif"</span>
         <span style="color: #8f0075;">:publishing-directory</span> ,publish-dir <span style="color: #595959; font-style: italic;">;;</span><span style="color: #595959; font-style: italic;">,(concat publish-dir "html/")</span>
         <span style="color: #8f0075;">:recursive</span> t
         <span style="color: #8f0075;">:publishing-function</span> org-publish-attachment)

        (<span style="color: #3548cf;">"blog"</span> <span style="color: #8f0075;">:components</span> (<span style="color: #3548cf;">"blog-org-files"</span> <span style="color: #3548cf;">"blog-static"</span>))))


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org16dba7a" class="outline-3">
<h3 id="org16dba7a"><span class="section-number-3">5.3.</span> Bibliography</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">bibtex</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #8f0075;">:custom</span>
  (bibtex-autokey-year-length 4)
  (bibtex-autokey-name-year-separator <span style="color: #3548cf;">"-"</span>)
  (bibtex-autokey-year-title-separator <span style="color: #3548cf;">"-"</span>)
  (bibtex-autokey-titleword-separator <span style="color: #3548cf;">"-"</span>)
  (bibtex-autokey-titlewords 2)
  (bibtex-autokey-titlewords-stretch 1)
  (bibtex-autokey-titleword-length 5)
  <span style="color: #8f0075;">:bind</span>
  (<span style="color: #8f0075;">:map</span> bibtex-mode-map
        (<span style="color: #3548cf;">"H-b"</span> . org-ref-bibtex-hydra/body)))

(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">ebib</span>
 <span style="color: #8f0075;">:after</span>
 (<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">org-ebib</span>)
 <span style="color: #8f0075;">:custom</span>
 (global-set-key (kbd <span style="color: #3548cf;">"C-c e"</span>) 'ebib)
 (<span style="color: #531ab6;">setq</span> ebib-bibtex-dialect 'biblatex) 
 (<span style="color: #531ab6;">setq</span> ebib-preload-bib-files '(<span style="color: #3548cf;">"../research/bibliography.bib"</span> <span style="color: #3548cf;">"~/Documents/bibliography.bib"</span>)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgeeefb09" class="outline-2">
<h2 id="orgeeefb09"><span class="section-number-2">6.</span> Document viewers</h2>
<div class="outline-text-2" id="text-6">
<p>
**PDF
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">pdf-tools</span>)
</pre>
</div>
</div>
<div id="outline-container-orgc5cb71d" class="outline-3">
<h3 id="orgc5cb71d"><span class="section-number-3">6.1.</span> DJVU</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">djvu</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org130f7bb" class="outline-3">
<h3 id="org130f7bb"><span class="section-number-3">6.2.</span> Markdown</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">markdown-mode</span>
  <span style="color: #8f0075;">:mode</span> (<span style="color: #3548cf;">"README\\.md\\'"</span> . gfm-mode)
  <span style="color: #8f0075;">:init</span> (<span style="color: #531ab6;">setq</span> markdown-command <span style="color: #3548cf;">"multimarkdown"</span>))
</pre>
</div>
</div>
</div>
</div>
