users/aziz/.config/emacs/az-emacs.org
** Treesitter
#+begin_src emacs-lisp :tangle "init.el"
  (use-package treesit-auto
    :config
    (global-treesit-auto-mode))

  ;; (dolist (mapping
  ;;          '((python-mode . python-ts-mode)
  ;; 	   (elixir-mode . elixir-ts-mode)
  ;;            (css-mode . css-ts-mode)
  ;;            (typescript-mode . typescript-ts-mode)
  ;;            (js2-mode . js-ts-mode)
  ;;            (bash-mode . bash-ts-mode)
  ;;            (css-mode . css-ts-mode)
  ;;            (json-mode . json-ts-mode)
  ;;            (js-json-mode . json-ts-mode))))

  ;; (add-to-list 'major-mode-remap-alist mapping)

  ;; (setq treesit-language-source-alist
  ;;    '((bash "https://github.com/tree-sitter/tree-sitter-bash")
  ;;      (cmake "https://github.com/uyha/tree-sitter-cmake")
  ;;      (css "https://github.com/tree-sitter/tree-sitter-css")
  ;;      (elisp "https://github.com/Wilfred/tree-sitter-elisp")
  ;;      (go "https://github.com/tree-sitter/tree-sitter-go")
  ;;      (html "https://github.com/tree-sitter/tree-sitter-html")
  ;;      (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
  ;;      (json "https://github.com/tree-sitter/tree-sitter-json")
  ;;      (make "https://github.com/alemuller/tree-sitter-make")
  ;;      (markdown "https://github.com/ikatyang/tree-sitter-markdown")
  ;;      (python "https://github.com/tree-sitter/tree-sitter-python")
  ;;      (toml "https://github.com/tree-sitter/tree-sitter-toml")
  ;;      (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
  ;;      (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
  ;;      (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

  ;; (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))


  (use-package combobulate
    :straight (combobulate :type git :host github :repo "mickeynp/combobulate")
    :preface
    (setq combobulate-key-prefix "C-c o")
    :hook
    ((python-ts-mode . combobulate-mode)
     (js-ts-mode . combobulate-mode)
     (html-ts-mode . combobulate-mode)
     (css-ts-mode . combobulate-mode)
     (yaml-ts-mode . combobulate-mode)
     (typescript-ts-mode . combobulate-mode)
     (json-ts-mode . combobulate-mode)
     (tsx-ts-mode . combobulate-mode)))
#+end_src
** Version control
#+begin_src emacs-lisp :tangle "init.el"
  (use-package magit
    :bind ("C-x g" . magit-status)
    :custom
    (magit-define-global-key-bindings 'recommended))
#+end_src
    
** Navigation
