users/aziz/blog/az-emacs.html
<div id="outline-container-org2fa087d" class="outline-2">
<h2 id="org2fa087d"><span class="section-number-2">7.</span> Editing</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org09d0b2f" class="outline-3">
<h3 id="org09d0b2f"><span class="section-number-3">7.1.</span> Treesitter</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">treesit-auto</span>
  <span style="color: #8f0075;">:config</span>
  (global-treesit-auto-mode))

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(dolist (mapping</span>
<span style="color: #595959; font-style: italic;">;;          </span><span style="color: #595959; font-style: italic;">'((python-mode . python-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">        (elixir-mode . elixir-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(css-mode . css-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(typescript-mode . typescript-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(js2-mode . js-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(bash-mode . bash-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(css-mode . css-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(json-mode . json-ts-mode)</span>
<span style="color: #595959; font-style: italic;">;;            </span><span style="color: #595959; font-style: italic;">(js-json-mode . json-ts-mode))))</span>

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(add-to-list 'major-mode-remap-alist mapping)</span>

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq treesit-language-source-alist</span>
<span style="color: #595959; font-style: italic;">;;    </span><span style="color: #595959; font-style: italic;">'((bash "https://github.com/tree-sitter/tree-sitter-bash")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(cmake "https://github.com/uyha/tree-sitter-cmake")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(css "https://github.com/tree-sitter/tree-sitter-css")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(elisp "https://github.com/Wilfred/tree-sitter-elisp")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(go "https://github.com/tree-sitter/tree-sitter-go")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(html "https://github.com/tree-sitter/tree-sitter-html")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(json "https://github.com/tree-sitter/tree-sitter-json")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(make "https://github.com/alemuller/tree-sitter-make")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(markdown "https://github.com/ikatyang/tree-sitter-markdown")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(python "https://github.com/tree-sitter/tree-sitter-python")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(toml "https://github.com/tree-sitter/tree-sitter-toml")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")</span>
<span style="color: #595959; font-style: italic;">;;      </span><span style="color: #595959; font-style: italic;">(yaml "https://github.com/ikatyang/tree-sitter-yaml")))</span>

<span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))</span>


(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">combobulate</span>
  <span style="color: #8f0075;">:straight</span> (combobulate <span style="color: #8f0075;">:type</span> git <span style="color: #8f0075;">:host</span> github <span style="color: #8f0075;">:repo</span> <span style="color: #3548cf;">"mickeynp/combobulate"</span>)
  <span style="color: #8f0075;">:preface</span>
  (<span style="color: #531ab6;">setq</span> combobulate-key-prefix <span style="color: #3548cf;">"C-c o"</span>)
  <span style="color: #8f0075;">:hook</span>
  ((python-ts-mode . combobulate-mode)
   (js-ts-mode . combobulate-mode)
   (html-ts-mode . combobulate-mode)
   (css-ts-mode . combobulate-mode)
   (yaml-ts-mode . combobulate-mode)
   (typescript-ts-mode . combobulate-mode)
   (json-ts-mode . combobulate-mode)
   (tsx-ts-mode . combobulate-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6df62fe" class="outline-3">
<h3 id="org6df62fe"><span class="section-number-3">7.2.</span> Version control</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">magit</span>
  <span style="color: #8f0075;">:bind</span> (<span style="color: #3548cf;">"C-x g"</span> . magit-status)
  <span style="color: #8f0075;">:custom</span>
  (magit-define-global-key-bindings 'recommended))
</pre>
</div>
</div>
</div>
