users/aziz/.config/emacs/az-emacs.org
*** Eglot
#+begin_src emacs-lisp :tangle "init.el"
   ;;;; eglot
  (use-package eglot
    :commands eglot
    :defer t
    :custom
    (eglot-autoshutdown t)
    :bind (:map eglot-mode-map
                ("C-c C-d" . eldoc))
  ;;              ("C-c C-e" . eglot-rename)
  ;;              ("C-c C-o" . python-sort-imports)
  ;;              ("C-c C-f" . eglot-format-buffer))
    :hook ((python-ts-mode . eglot-ensure)
           (python-ts-mode . flyspell-prog-mode)
           (python-ts-mode . superword-mode)
           (python-ts-mode . hs-minor-mode)
           (python-ts-mode . (lambda () (set-fill-column 88)))
           (nix-ts-mode . eglot-ensure)
           (tex-mode . eglot-ensure)
           ;; (prog-mode . (lambda ()
           ;;               (add-hook 'before-save-hook 'eglot-format nil t)))
           )

    :config
    (add-to-list
     'eglot-server-programs
     '(nix-ts-mode
       . ("nix-shell" "-p" "nixd" "--run" "nixd")))
    (add-to-list
     'eglot-server-programs
     '((elixir-ts-mode heex-ts-mode)
       ;; TODO remove elixir package from runtime shell
       . ("nix-shell" "-p" "elixir-ls" "elixir" "--run" "elixir-ls")))

    (setq read-process-output-max (* 1024 1024))
    ;; (with-eval-after-load 'eglot
    ;;   (dolist (mode '((nix-mode . ("nixd"))))
    ;;     (add-to-list 'eglot-server-programs mode)))


    (add-hook 'eglot-managed-mode-hook
            #'(lambda ()
                ;; Show flymake diagnostics first.
                (setq eldoc-documentation-functions
                      (cons #'flymake-eldoc-function
                            (remove #'flymake-eldoc-function
                                    eldoc-documentation-functions)))))
    (setq-default eglot-workspace-configuration '(
        (:pylsp . (:configurationSources ["flake8"] :plugins (
                   :pycodestyle (:enabled t) :mccabe (:enabled t)
                   :pyflakes (:enabled t) :flake8 (:enabled t
                   :maxLineLength 88) :ruff (:enabled t :lineLength 88)
                   :pydocstyle (:enabled t :convention "numpy") :yapf
                   (:enabled t) :autopep8 (:enabled :json-false) :black
                   (:enabled t :line_length 88 :cache_config t))))

        (:nixd
         (:nixpkgs
          (:expr "import <nixpkgs> { }"))))))
#+end_src

*** dumb-jump
#+begin_src emacs-lisp :tangle "init.el"
  (use-package dumb-jump
    :straight t
    ;; :hook
    ;; (('xref-backend-functions #'dumb-jump-xref-activate))
    :config
    (setq dumb-jump-force-searcher 'rg)
    (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
    (setq xref-show-definitions-function 'xref-show-definitions-completing-read)
    ;; (setq xref-show-definitions-function 'xref-show-definitions-buffer)
    )
#+end_src
** Project management
#+begin_src emacs-lisp :tangle "init.el"
  ;; projectile
  (use-package projectile
  :init
  (projectile-mode t)
  (require 'tramp)
  :bind
  ((:map projectile-mode-map
         ("s-p" . projectile-command-map))
         ("s-p v" . 'magit))

  :config
  (setq projectile-sort-order 'recentf)
  (setq projectile-git-use-fd t)
  (setq projectile-enable-caching t)
  (setq projectile-completion-system 'helm)
  (setq projectile-switch-project-action 'helm-projectile)
  (advice-add 'projectile-project-root :before-while
              (lambda (&optional dir)
                (not (file-remote-p (or dir default-directory)))))
  (add-to-list 'projectile-other-file-alist '("ex" . ("html.heex" "html.leex")))
  (add-to-list 'projectile-other-file-alist '("html.heex" . ("ex")))
  (add-to-list 'projectile-other-file-alist '("html.leex" . ("ex")))
  )
#+end_src
** Programming languages
*** Elixir
#+begin_src emacs-lisp :tangle "init.el"
  (use-package elixir-mode)
#+end_src
