users/aziz/blog/az-emacs.html
<div id="outline-container-org7131623" class="outline-3">
<h3 id="org7131623"><span class="section-number-3">7.3.</span> Navigation</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-orgd8f0904" class="outline-4">
<h4 id="orgd8f0904"><span class="section-number-4">7.3.1.</span> Eglot</h4>
<div class="outline-text-4" id="text-7-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #595959; font-style: italic;">;;;; </span><span style="color: #595959; font-style: italic;">eglot</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">eglot</span>
  <span style="color: #8f0075;">:commands</span> eglot
  <span style="color: #8f0075;">:defer</span> t
  <span style="color: #8f0075;">:custom</span>
  (eglot-autoshutdown t)
  <span style="color: #8f0075;">:bind</span> (<span style="color: #8f0075;">:map</span> eglot-mode-map
              (<span style="color: #3548cf;">"C-c C-d"</span> . eldoc))
<span style="color: #595959; font-style: italic;">;;              </span><span style="color: #595959; font-style: italic;">("C-c C-e" . eglot-rename)</span>
<span style="color: #595959; font-style: italic;">;;              </span><span style="color: #595959; font-style: italic;">("C-c C-o" . python-sort-imports)</span>
<span style="color: #595959; font-style: italic;">;;              </span><span style="color: #595959; font-style: italic;">("C-c C-f" . eglot-format-buffer))</span>
  <span style="color: #8f0075;">:hook</span> ((python-ts-mode . eglot-ensure)
         (python-ts-mode . flyspell-prog-mode)
         (python-ts-mode . superword-mode)
         (python-ts-mode . hs-minor-mode)
         (python-ts-mode . (<span style="color: #531ab6;">lambda</span> () (set-fill-column 88)))
         (nix-ts-mode . eglot-ensure)
         (tex-mode . eglot-ensure)
         <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(prog-mode . (lambda ()</span>
         <span style="color: #595959; font-style: italic;">;;               </span><span style="color: #595959; font-style: italic;">(add-hook 'before-save-hook 'eglot-format nil t)))</span>
         )

  <span style="color: #8f0075;">:config</span>
  (add-to-list
   'eglot-server-programs
   '(nix-ts-mode
     . (<span style="color: #3548cf;">"nix-shell"</span> <span style="color: #3548cf;">"-p"</span> <span style="color: #3548cf;">"nixd"</span> <span style="color: #3548cf;">"--run"</span> <span style="color: #3548cf;">"nixd"</span>)))
  (add-to-list
   'eglot-server-programs
   '((elixir-ts-mode heex-ts-mode)
     <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">TODO remove elixir package from runtime shell</span>
     . (<span style="color: #3548cf;">"nix-shell"</span> <span style="color: #3548cf;">"-p"</span> <span style="color: #3548cf;">"elixir-ls"</span> <span style="color: #3548cf;">"elixir"</span> <span style="color: #3548cf;">"--run"</span> <span style="color: #3548cf;">"elixir-ls"</span>)))

  (<span style="color: #531ab6;">setq</span> read-process-output-max (* 1024 1024))
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(with-eval-after-load 'eglot</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">(dolist (mode '((nix-mode . ("nixd"))))</span>
  <span style="color: #595959; font-style: italic;">;;     </span><span style="color: #595959; font-style: italic;">(add-to-list 'eglot-server-programs mode)))</span>


  (add-hook 'eglot-managed-mode-hook
          #'(<span style="color: #531ab6;">lambda</span> ()
              <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Show flymake diagnostics first.</span>
              (<span style="color: #531ab6;">setq</span> eldoc-documentation-functions
                    (cons #'flymake-eldoc-function
                          (remove #'flymake-eldoc-function
                                  eldoc-documentation-functions)))))
  (<span style="color: #531ab6;">setq-default</span> eglot-workspace-configuration '(
      (<span style="color: #8f0075;">:pylsp</span> . (<span style="color: #8f0075;">:configurationSources</span> [<span style="color: #3548cf;">"flake8"</span>] <span style="color: #8f0075;">:plugins</span> (
                 <span style="color: #8f0075;">:pycodestyle</span> (<span style="color: #8f0075;">:enabled</span> t) <span style="color: #8f0075;">:mccabe</span> (<span style="color: #8f0075;">:enabled</span> t)
                 <span style="color: #8f0075;">:pyflakes</span> (<span style="color: #8f0075;">:enabled</span> t) <span style="color: #8f0075;">:flake8</span> (<span style="color: #8f0075;">:enabled</span> t
                 <span style="color: #8f0075;">:maxLineLength</span> 88) <span style="color: #884900;">:ruff</span><span style="color: #884900;"> (</span><span style="color: #884900;">:enabled</span><span style="color: #884900;"> t </span><span style="color: #884900;">:lineLength</span><span style="color: #884900;"> 88)</span>
                 <span style="color: #8f0075;">:pydocstyle</span> (<span style="color: #8f0075;">:enabled</span> t <span style="color: #8f0075;">:convention</span> <span style="color: #3548cf;">"numpy"</span>) <span style="color: #8f0075;">:yapf</span>
                 (<span style="color: #8f0075;">:enabled</span> t) <span style="color: #8f0075;">:autopep8</span> (<span style="color: #8f0075;">:enabled</span> <span style="color: #8f0075;">:json-false</span>) <span style="color: #8f0075;">:black</span>
                 (<span style="color: #8f0075;">:enabled</span> t <span style="color: #8f0075;">:line_length</span> 88 <span style="color: #8f0075;">:cache_config</span> t))))

      (<span style="color: #8f0075;">:nixd</span>
       (<span style="color: #8f0075;">:nixpkgs</span>
        (<span style="color: #8f0075;">:expr</span> <span style="color: #3548cf;">"import &lt;nixpkgs&gt; { }"</span>))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdcdb6cb" class="outline-4">
<h4 id="orgdcdb6cb"><span class="section-number-4">7.3.2.</span> dumb-jump</h4>
<div class="outline-text-4" id="text-7-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">dumb-jump</span>
  <span style="color: #8f0075;">:straight</span> t
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">:hook</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(('xref-backend-functions #'dumb-jump-xref-activate))</span>
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">setq</span> dumb-jump-force-searcher 'rg)
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (<span style="color: #531ab6;">setq</span> xref-show-definitions-function 'xref-show-definitions-completing-read)
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(setq xref-show-definitions-function 'xref-show-definitions-buffer)</span>
  )
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf4385a0" class="outline-3">
<h3 id="orgf4385a0"><span class="section-number-3">7.4.</span> Project management</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">projectile</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">projectile</span>
<span style="color: #8f0075;">:init</span>
(projectile-mode t)
(<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">tramp</span>)
<span style="color: #8f0075;">:bind</span>
((<span style="color: #8f0075;">:map</span> projectile-mode-map
       (<span style="color: #3548cf;">"s-p"</span> . projectile-command-map))
       (<span style="color: #3548cf;">"s-p v"</span> . 'magit))

<span style="color: #8f0075;">:config</span>
(<span style="color: #531ab6;">setq</span> projectile-sort-order 'recentf)
(<span style="color: #531ab6;">setq</span> projectile-git-use-fd t)
(<span style="color: #531ab6;">setq</span> projectile-enable-caching t)
(<span style="color: #531ab6;">setq</span> projectile-completion-system 'helm)
(<span style="color: #531ab6;">setq</span> projectile-switch-project-action 'helm-projectile)
(advice-add 'projectile-project-root <span style="color: #8f0075;">:before-while</span>
            (<span style="color: #531ab6;">lambda</span> (<span style="color: #005f5f;">&amp;optional</span> dir)
              (not (file-remote-p (<span style="color: #531ab6;">or</span> dir default-directory)))))
(add-to-list 'projectile-other-file-alist '(<span style="color: #3548cf;">"ex"</span> . (<span style="color: #3548cf;">"html.heex"</span> <span style="color: #3548cf;">"html.leex"</span>)))
(add-to-list 'projectile-other-file-alist '(<span style="color: #3548cf;">"html.heex"</span> . (<span style="color: #3548cf;">"ex"</span>)))
(add-to-list 'projectile-other-file-alist '(<span style="color: #3548cf;">"html.leex"</span> . (<span style="color: #3548cf;">"ex"</span>)))
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a06f5c" class="outline-3">
<h3 id="org3a06f5c"><span class="section-number-3">7.5.</span> Programming languages</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-org8cd2cc8" class="outline-4">
<h4 id="org8cd2cc8"><span class="section-number-4">7.5.1.</span> Elixir</h4>
<div class="outline-text-4" id="text-7-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">elixir-mode</span>)
</pre>
</div>
</div>
</div>
