users/aziz/.config/emacs/az-emacs.org
*** Nix
https://github.com/NixOS/nix-mode?tab=readme-ov-filelsp
#+begin_src emacs-lisp :tangle "init.el"
  ;; Nix
  (use-package nix-mode
    :mode ("\\.nix\\'" "\\.nix.in\\'")
    :config
    ;; (use-package nix-drv-mode
    ;;   :ensure nix-mode
    ;;   :mode "\\.drv\\'")

    ;; (use-package nix-shell
    ;;   :ensure nix-mode
    ;;   :commands (nix-shell-unpack nix-shell-configure nix-shell-build))

    ;; (use-package nix-repl
    ;;   :ensure nix-mode
    ;;   :commands (nix-repl))
    )
#+end_src

*** Terraform
#+begin_src emacs-lisp :tangle "init.el"
  (use-package terraform-mode
   :custom (terraform-indent-level 4)
   :config
   (defun my-terraform-mode-init ()
     ;; if you want to use outline-minor-mode
     ;; (outline-minor-mode 1)
     )
   (add-hook 'terraform-mode-hook 'my-terraform-mode-init))
#+end_src

*** Typescript
#+begin_src emacs-lisp :tangle "init.el"
  (add-to-list 'auto-mode-alist '("\\.ts\\(x\\)?\\'" . tsx-ts-mode))
#+end_src
** Snippets
#+begin_src emacs-lisp :tangle "init.el"
  (use-package yasnippet
    :config
    (yas-global-mode 1)
    ;; get more snippets from here
    ;; https://github.com/AndreaCrotti/yasnippet-snippets/tree/master/snippets
    (setq yas-snippet-dirs
        '("~/.emacs.d/snippets")))
#+end_src

** Mathematics
#+begin_src emacs-lisp :tangle "init.el"
  ;; Auctex
  (use-package auctex)
  (use-package cdlatex)
  (use-package tex
    :straight nil
    :ensure auctex
    :defer t
   ;; :mode ("\\.tex\\'" . LaTeX-mode)
    :hook ((LaTeX-mode . TeX-source-correlate-mode)
           (LaTeX-mode . TeX-PDF-mode)
           (LaTeX-mode . turn-on-reftex)
           (LaTeX-mode . abbrev-mode))
    :custom
    (TeX-PDF-mode t)
    (TeX-auto-save t)
    (TeX-auto-untabify t)
    (TeX-electric-escape t)
    (TeX-electric-math '("\\(" . "\\)"))
    (TeX-engine 'xetex)
    (TeX-parse-self t)
    (TeX-master nil)
    ;; Eglot keybindings interferes with auctex
    (with-eval-after-load 'eglot
      (define-key eglot-mode-map (kbd "C-c C-e") nil)
    :config
    ;; Set Skim as the PDF viewer
    (setq TeX-view-program-list
          '(("Skim" "open -a Skim.app %o")))
    (setq TeX-view-program-selection
          '((output-pdf "Skim")
            ((output-dvi style-pstricks)
             "dvips and gv")
            (output-dvi "xdvi")
            (output-html "open")))
    ;; Configure Skim to auto-reload PDF files
    (setq TeX-source-correlate-mode t)
    (setq TeX-source-correlate-start-server t)
    ;; Sync TeX source with Skim
    (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer)))


  ;;   :defines
  ;;   (latex-help-cmd-alist
  ;;    latex-help-file)
  ;;   :preface
  ;;   (defvar latex-prettify-symbols-alist
  ;;     '(("\N{THIN SPACE}" . ?\⟷)))
  ;;   :config
  ;;   (require 'preview)

    ;; (defun latex-help-get-cmd-alist ()    ;corrected version:
    ;;   "Scoop up the commands in the index of the latex info manual.
    ;;  The values are saved in `latex-help-cmd-alist' for speed."
    ;;   ;; mm, does it contain any cached entries
    ;;   (if (not (assoc "\\begin" latex-help-cmd-alist))
    ;;       (save-window-excursion
    ;;         (setq latex-help-cmd-alist nil)
    ;;         (Info-goto-node (concat latex-help-file "Command Index"))
    ;;         (goto-char (point-max))
    ;;         (while (re-search-backward "^\\* \\(.+\\): *\\(.+\\)\\." nil t)
    ;;           (let ((key (buffer-substring (match-beginning 1) (match-end 1)))
    ;;                 (value (buffer-substring (match-beginning 2)
    ;;                                          (match-end 2))))
    ;;             (add-to-list 'latex-help-cmd-alist (cons key value))))))
    ;;   latex-help-cmd-alist)

    ;; (info-lookup-add-help :mode 'LaTeX-mode
    ;;                       :regexp ".*"
    ;;                       :parse-rule "\\\\?[a-zA-Z]+\\|\\\\[^a-zA-Z]"
    ;;                       :doc-spec '(("(latex2e)Concept Index")
    ;;                                   ("(latex2e)Command Index")))

    ;; (add-hook 'LaTeX-mode-hook
    ;;           #'(lambda
    ;;               ()
    ;;               (setq-local prettify-symbols-alist latex-prettify-symbols-alist)
    ;;               (prettify-symbols-mode 1)))

    ;; (add-hook 'TeX-after-compilation-finished-functions
    ;;           #'TeX-revert-document-buffer))
#+end_src
* Misc
** Slurm
#+begin_src emacs-lisp :tangle "init.el"
  (use-package slurm-mode
    :config
    (require 'slurm-script-mode))
#+end_src

** Distraction free environment
#+begin_src emacs-lisp :tangle "init.el"
  (use-package writeroom-mode)
#+end_src
