users/aziz/blog/az-emacs.html
<div id="outline-container-org53b5f57" class="outline-4">
<h4 id="org53b5f57"><span class="section-number-4">7.5.2.</span> Nix</h4>
<div class="outline-text-4" id="text-7-5-2">
<p>
<a href="https://github.com/NixOS/nix-mode?tab=readme-ov-filelsp">https://github.com/NixOS/nix-mode?tab=readme-ov-filelsp</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">Nix</span>
(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">nix-mode</span>
  <span style="color: #8f0075;">:mode</span> (<span style="color: #3548cf;">"\\.nix\\'"</span> <span style="color: #3548cf;">"\\.nix.in\\'"</span>)
  <span style="color: #8f0075;">:config</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(use-package nix-drv-mode</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">:ensure nix-mode</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">:mode "\\.drv\\'")</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(use-package nix-shell</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">:ensure nix-mode</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">:commands (nix-shell-unpack nix-shell-configure nix-shell-build))</span>

  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(use-package nix-repl</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">:ensure nix-mode</span>
  <span style="color: #595959; font-style: italic;">;;   </span><span style="color: #595959; font-style: italic;">:commands (nix-repl))</span>
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org74967d9" class="outline-4">
<h4 id="org74967d9"><span class="section-number-4">7.5.3.</span> Terraform</h4>
<div class="outline-text-4" id="text-7-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">terraform-mode</span>
 <span style="color: #8f0075;">:custom</span> (terraform-indent-level 4)
 <span style="color: #8f0075;">:config</span>
 (<span style="color: #531ab6;">defun</span> <span style="color: #721045;">my-terraform-mode-init</span> ()
   <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">if you want to use outline-minor-mode</span>
   <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(outline-minor-mode 1)</span>
   )
 (add-hook 'terraform-mode-hook 'my-terraform-mode-init))
</pre>
</div>
</div>
</div>
<div id="outline-container-org46ea4da" class="outline-4">
<h4 id="org46ea4da"><span class="section-number-4">7.5.4.</span> Typescript</h4>
<div class="outline-text-4" id="text-7-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #3548cf;">"\\.ts</span><span style="color: #721045;">\\</span><span style="color: #00663f;">(</span><span style="color: #3548cf;">x</span><span style="color: #721045;">\\</span><span style="color: #00663f;">)</span><span style="color: #3548cf;">?\\'"</span> . tsx-ts-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdcaaa55" class="outline-3">
<h3 id="orgdcaaa55"><span class="section-number-3">7.6.</span> Snippets</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">yasnippet</span>
  <span style="color: #8f0075;">:config</span>
  (yas-global-mode 1)
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">get more snippets from here</span>
  <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">https://github.com/AndreaCrotti/yasnippet-snippets/tree/master/snippets</span>
  (<span style="color: #531ab6;">setq</span> yas-snippet-dirs
      '(<span style="color: #3548cf;">"~/.emacs.d/snippets"</span>)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8c76c8b" class="outline-2">
<h2 id="org8c76c8b"><span class="section-number-2">8.</span> Misc</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgbce0b54" class="outline-3">
<h3 id="orgbce0b54"><span class="section-number-3">8.1.</span> Slurm</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> <span style="color: #0000b0;">slurm-mode</span>
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">slurm-script-mode</span>))
</pre>
</div>
</div>
</div>
</div>
